{"Published": "2016-01-13", "Title": "Why Johnny Still, Still Can't Encrypt: Evaluating the Usability of a Modern PGP Client", "Authors": "Scott Ruoti, Jeff Andersen, Daniel Zappala, Kent Seamons", "Summary": "This paper presents the results of a laboratory study involving Mailvelope, a modern PGP client that integrates tightly with existing webmail providers. In our study, we brought in pairs of participants and had them attempt to use Mailvelope to communicate with each other. Our results shown that more than a decade and a half after \\textit{Why Johnny Can't Encrypt}, modern PGP tools are still unusable for the masses. We finish with a discussion of pain points encountered using Mailvelope, and discuss what might be done to address them in future PGP systems.", "main_contribution": {"headline": "Modern PGP tools remain unusable for the masses", "description": "The paper presents a laboratory study involving Mailvelope, a modern PGP client, to evaluate its usability. The study involved pairs of participants attempting to use Mailvelope to communicate with each other. The results showed that despite being more than a decade and a half since the publication of 'Why Johnny Can't Encrypt', modern PGP tools are still largely unusable for the general public. Only one pair out of ten was able to successfully complete the assigned tasks using Mailvelope, highlighting the persistent usability issues with PGP tools."}, "takeaways": {"headline": "Improvements needed for PGP-based tools to enhance usability", "description": "The study provides valuable insights into the usability issues of PGP-based tools, particularly Mailvelope. It suggests several ways to improve these tools, such as integrated tutorials, approachable descriptions of public key cryptography, automatically generated emails for unknown recipients, and enhancements to the PGP block. These insights can guide the development of more user-friendly secure email systems, potentially expanding the use of encryption in everyday communication.", "example": "For instance, an LLM could be trained to generate user-friendly tutorials and descriptions of public key cryptography, or to automatically generate emails for unknown recipients. It could also be used to enhance the PGP block to help non-PGP users understand how to work with encrypted messages."}, "category": "USE CASES", "novelty_analysis": "The paper does not introduce any new algorithms or techniques. Instead, it provides an updated evaluation of the usability of modern PGP tools, highlighting that despite advancements in technology, usability issues persist. This reaffirms the importance of user-centered design in the development of secure email systems.", "novelty_score": 1, "technical_analysis": "The paper is not overly technical. It presents the results of a user study and discusses the usability issues encountered, without delving into the technical details of how PGP or Mailvelope works. The paper is accessible to a wide range of readers, including those without a technical background.", "technical_score": 1, "enjoyable_analysis": "The paper is well-structured and presents its findings in a clear and concise manner. The discussion of usability issues provides valuable insights into the challenges of designing user-friendly secure email systems. However, the lack of technical details and the focus on usability issues might make the paper less appealing to readers interested in the technical aspects of PGP or Mailvelope.", "enjoyable_score": 2}