{"Published": "2019-09-11", "Title": "Large-Scale Multilingual Speech Recognition with a Streaming End-to-End Model", "Authors": "Anjuli Kannan, Arindrima Datta, Tara N. Sainath, Eugene Weinstein, Bhuvana Ramabhadran, Yonghui Wu, Ankur Bapna, Zhifeng Chen, Seungji Lee", "Summary": "Multilingual end-to-end (E2E) models have shown great promise in expansion of automatic speech recognition (ASR) coverage of the world's languages. They have shown improvement over monolingual systems, and have simplified training and serving by eliminating language-specific acoustic, pronunciation, and language models. This work presents an E2E multilingual system which is equipped to operate in low-latency interactive applications, as well as handle a key challenge of real world data: the imbalance in training data across languages. Using nine Indic languages, we compare a variety of techniques, and find that a combination of conditioning on a language vector and training language-specific adapter layers produces the best model. The resulting E2E multilingual model achieves a lower word error rate (WER) than both monolingual E2E models (eight of nine languages) and monolingual conventional systems (all nine languages).", "main_contribution": "The paper presents a novel end-to-end (E2E) multilingual system for automatic speech recognition (ASR) that is designed to operate in low-latency interactive applications and handle imbalances in training data across languages. The authors propose a combination of conditioning on a language vector and training language-specific adapter layers as the most effective technique. The system uses the Recurrent Neural Network Transducer (RNN-T) architecture, which allows for streaming implementation, a feature not straightforwardly available in previous E2E multilingual models.", "takeaways": "The proposed E2E multilingual system simplifies the training and serving of ASR models by eliminating language-specific acoustic, pronunciation, and language models. It also addresses the challenge of data imbalance across languages, a common issue in real-world applications. The system's ability to operate in low-latency interactive applications makes it suitable for use in real-time applications such as speech-enabled assistants. The use of RNN-T architecture allows for streaming implementation, making the system more efficient and practical.", "novelty_analysis": "The paper's main novelty lies in the development of an E2E multilingual ASR system that can handle data imbalance across languages and operate in low-latency interactive applications. The use of RNN-T architecture for streaming implementation is also a significant advancement over previous E2E multilingual models.", "novelty_score": 3, "category": "ARCHITECTURES", "technical_analysis": "The paper is quite technical, discussing the design and implementation of a novel E2E multilingual ASR system, the challenges of data imbalance across languages, and the use of RNN-T architecture for streaming implementation. It requires a good understanding of ASR systems, neural network architectures, and language modeling.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field of ASR. However, its highly technical content and focus on a specific application may limit its appeal to a broader audience.", "enjoyable_score": 2}