{"Published": "2022-12-20", "Title": "Toward Human Readable Prompt Tuning: Kubrick's The Shining is a good movie, and a good prompt too?", "Authors": "Weijia Shi, Xiaochuang Han, Hila Gonen, Ari Holtzman, Yulia Tsvetkov, Luke Zettlemoyer", "Summary": "Large language models can perform new tasks in a zero-shot fashion, given natural language prompts that specify the desired behavior. Such prompts are typically hand engineered, but can also be learned with gradient-based methods from labeled data. However, it is underexplored what factors make the prompts effective, especially when the prompts are natural language. In this paper, we investigate common attributes shared by effective prompts. We first propose a human readable prompt tuning method (F LUENT P ROMPT) based on Langevin dynamics that incorporates a fluency constraint to find a diverse distribution of effective and fluent prompts. Our analysis reveals that effective prompts are topically related to the task domain and calibrate the prior probability of label words. Based on these findings, we also propose a method for generating prompts using only unlabeled data, outperforming strong baselines by an average of 7.0% accuracy across three tasks.", "main_contribution": "The paper introduces FLUENTPROMPT, a human-readable prompt tuning method based on Langevin dynamics. This method incorporates a fluency constraint to find a diverse distribution of effective and fluent prompts. The authors also analyze the common attributes shared by effective prompts, revealing that they are topically related to the task domain and calibrate the prior probability of label words.", "takeaways": "FLUENTPROMPT offers a significant improvement over previous methods by generating prompts that are not only effective but also more readable and topically relevant. This can lead to better trust and engagement from both researchers and end users. The method also outperforms strong baselines by an average of 7.0% accuracy across three tasks, even when using only unlabeled data.", "novelty_analysis": "The introduction of FLUENTPROMPT and the analysis of the common attributes of effective prompts provide a new perspective in the field of prompt tuning. The use of Langevin dynamics and a fluency constraint in prompt generation is a novel approach that enhances the readability and effectiveness of the prompts.", "novelty_score": 3, "category": "PROMPTING", "technical_analysis": "The paper is quite technical, introducing a new algorithm and discussing its implementation using Langevin dynamics. It also delves into the analysis of the factors contributing to the effectiveness of prompts, requiring a good understanding of the field.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field of prompt tuning. However, the highly technical content may make it challenging for some readers.", "enjoyable_score": 2}