{"Published": "2022-09-05", "Title": "Selective Annotation Makes Language Models Better Few-Shot Learners", "Authors": "Hongjin Su, Jungo Kasai, Chen Henry Wu, Weijia Shi, Tianlu Wang, Jiayi Xin, Rui Zhang, Mari Ostendorf, Luke Zettlemoyer, Noah A. Smith, Tao Yu", "Summary": "Many recent approaches to natural language tasks are built on the remarkable abilities of large language models. Large language models can perform in-context learning, where they learn a new task from a few task demonstrations, without any parameter updates. This work examines the implications of in-context learning for the creation of datasets for new natural language tasks. Departing from recent in-context learning methods, we formulate an annotation-efficient, two-step framework: selective annotation that chooses a pool of examples to annotate from unlabeled data in advance, followed by prompt retrieval that retrieves task examples from the annotated pool at test time. Based on this framework, we propose an unsupervised, graph-based selective annotation method, voke-k, to select diverse, representative examples to annotate. Extensive experiments on 10 datasets (covering classification, commonsense reasoning, dialogue, and text/code generation) demonstrate that our selective annotation method improves the task performance by a large margin. On average, vote-k achieves a 12.9%/11.4% relative gain under an annotation budget of 18/100, as compared to randomly selecting examples to annotate. Compared to state-of-the-art supervised finetuning approaches, it yields similar performance with 10-100x less annotation cost across 10 tasks. We further analyze the effectiveness of our framework in various scenarios: language models with varying sizes, alternative selective annotation methods, and cases where there is a test data domain shift. We hope that our studies will serve as a basis for data annotations as large language models are increasingly applied to new tasks. Our code is available at https://github.com/HKUNLP/icl-selective-annotation.", "main_contribution": "The paper introduces a two-step framework for in-context learning with large language models (LLMs). The first step, selective annotation, involves choosing a pool of examples to annotate from unlabeled data in advance. The second step, prompt retrieval, retrieves task examples from the annotated pool at test time. The authors propose an unsupervised, graph-based selective annotation method, vote-k, which selects diverse, representative examples to annotate. This method is shown to improve task performance significantly across a variety of datasets and tasks.", "takeaways": "The proposed framework and vote-k method offer a more efficient way to create datasets for new natural language tasks. The method achieves similar performance to state-of-the-art supervised finetuning approaches but with 10-100x less annotation cost. This approach could be particularly beneficial in scenarios where there are language models of varying sizes, alternative selective annotation methods, and cases where there is a test data domain shift.", "novelty_analysis": "The paper presents a novel approach to in-context learning with LLMs, introducing a two-step framework and a new method, vote-k, for selective annotation. This approach differs from previous methods by focusing on the efficient creation of datasets for new tasks, rather than on the learning process itself.", "novelty_score": 3, "category": "TRAINING", "technical_analysis": "The paper is somewhat technical, introducing a new method and framework for in-context learning with LLMs. It requires a basic understanding of machine learning and natural language processing concepts.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel approach to a significant problem in the field of LLMs. The clear presentation of the method and the extensive experimental results make it an interesting read.", "enjoyable_score": 3}