{"Published": "2022-12-22", "Title": "Large Language Models are Few-shot Testers: Exploring LLM-based General Bug Reproduction", "Authors": "Sungmin Kang, Juyeon Yoon, Shin Yoo", "Summary": "Many automated test generation techniques have been developed to aid developers with writing tests. To facilitate full automation, most existing techniques aim to either increase coverage, or generate exploratory inputs. However, existing test generation techniques largely fall short of achieving more semantic objectives, such as generating tests to reproduce a given bug report. Reproducing bugs is nonetheless important, as our empirical study shows that the number of tests added in open source repositories due to issues was about 28% of the corresponding project test suite size. Meanwhile, due to the difficulties of transforming the expected program semantics in bug reports into test oracles, existing failure reproduction techniques tend to deal exclusively with program crashes, a small subset of all bug reports. To automate test generation from general bug reports, we propose LIBRO, a framework that uses Large Language Models (LLMs), which have been shown to be capable of performing code-related tasks. Since LLMs themselves cannot execute the target buggy code, we focus on post-processing steps that help us discern when LLMs are effective, and rank the produced tests according to their validity. Our evaluation of LIBRO shows that, on the widely studied Defects4J benchmark, LIBRO can generate failure reproducing test cases for 33% of all studied cases (251 out of 750), while suggesting a bug reproducing test in first place for 149 bugs. To mitigate data contamination, we also evaluate LIBRO against 31 bug reports submitted after the collection of the LLM training data terminated: LIBRO produces bug reproducing tests for 32% of the studied bug reports. Overall, our results show LIBRO has the potential to significantly enhance developer efficiency by automatically generating tests from bug reports.", "main_contribution": {"headline": "LIBRO: A Framework for Automating Test Generation from Bug Reports Using LLMs", "description": "The paper introduces LIBRO, a novel framework that leverages Large Language Models (LLMs) to automate the generation of tests from bug reports. LIBRO addresses the challenge of transforming the expected program semantics in bug reports into test oracles, a task that existing techniques struggle with. The framework uses LLMs to perform code-related tasks and includes post-processing steps to discern when LLMs are effective and to rank the produced tests according to their validity. The authors demonstrate that LIBRO can generate failure reproducing test cases for a significant portion of studied cases, showing its potential to enhance developer efficiency."}, "takeaways": {"headline": "LIBRO Framework Automates Test Generation from Bug Reports, Enhancing Developer Efficiency", "description": "The LIBRO framework presents a promising approach for automating the generation of tests from bug reports, a task that often requires significant human effort. By leveraging the capabilities of LLMs in performing code-related tasks, LIBRO can generate failure reproducing test cases, thereby potentially enhancing developer efficiency. However, it's important to note that LLMs cannot execute the target buggy code, and the framework relies on post-processing steps to discern the effectiveness of LLMs and rank the produced tests.", "example": "For instance, given a bug report, LIBRO can use an LLM to generate a test case that reproduces the bug. The framework then uses post-processing steps to evaluate the validity of the test case and rank it accordingly. This automated process can significantly reduce the time and effort developers spend on writing tests."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel approach to automating test generation from bug reports, a task that has traditionally required significant human effort. The introduction of the LIBRO framework, which leverages LLMs for this task, represents a significant advancement in the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the workings of the LIBRO framework and how it leverages LLMs to automate test generation from bug reports. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a background in computer science or software engineering.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of automated test generation. However, the technical nature of the content might make it less enjoyable for readers without a background in the field.", "enjoyable_score": 2}