{"Published": "2022-08-08", "Title": "Social Simulacra: Creating Populated Prototypes for Social Computing Systems", "Authors": "Joon Sung Park, Lindsay Popowski, Carrie J. Cai, Meredith Ringel Morris, Percy Liang, Michael S. Bernstein", "Summary": "Social computing prototypes probe the social behaviors that may arise in an envisioned system design. This prototyping practice is currently limited to recruiting small groups of people. Unfortunately, many challenges do not arise until a system is populated at a larger scale. Can a designer understand how a social system might behave when populated, and make adjustments to the design before the system falls prey to such challenges? We introduce social simulacra, a prototyping technique that generates a breadth of realistic social interactions that may emerge when a social computing system is populated. Social simulacra take as input the designer's description of a community's design -- goal, rules, and member personas -- and produce as output an instance of that design with simulated behavior, including posts, replies, and anti-social behaviors. We demonstrate that social simulacra shift the behaviors that they generate appropriately in response to design changes, and that they enable exploration of \"what if?\" scenarios where community members or moderators intervene. To power social simulacra, we contribute techniques for prompting a large language model to generate thousands of distinct community members and their social interactions with each other; these techniques are enabled by the observation that large language models' training data already includes a wide variety of positive and negative behavior on social media platforms. In evaluations, we show that participants are often unable to distinguish social simulacra from actual community behavior and that social computing designers successfully refine their social computing designs when using social simulacra.", "main_contribution": {"headline": "Social Simulacra: A Novel Prototyping Technique for Social Computing Systems", "description": "The paper introduces 'Social Simulacra', a novel prototyping technique that simulates realistic social interactions in a social computing system. This technique takes as input the designer's description of a community's design, including its goal, rules, and member personas, and produces an instance of that design with simulated behavior. The behaviors generated by social simulacra can shift appropriately in response to design changes, enabling exploration of 'what if?' scenarios. The authors also contribute techniques for prompting a large language model to generate thousands of distinct community members and their social interactions, leveraging the wide variety of positive and negative behavior already present in the training data of large language models."}, "takeaways": {"headline": "Social Simulacra Enables Realistic Simulation of Social Interactions in Prototyping", "description": "The 'Social Simulacra' technique can be a powerful tool for AI practitioners working on social computing systems. It allows for the simulation of a wide range of social interactions, providing valuable insights into potential challenges and behaviors that may arise when the system is populated at a larger scale. This can help designers make informed decisions and adjustments to the design before the system is fully implemented. The techniques for prompting a large language model to generate distinct community members and their interactions can also be applied in other contexts where realistic social behavior simulation is needed.", "example": "For instance, when designing a new social media platform, a designer can use 'Social Simulacra' to simulate how users might interact under different rules and community goals. This can help identify potential issues and make necessary adjustments before the platform is launched."}, "category": "USE CASES", "novelty_analysis": "The introduction of 'Social Simulacra' as a prototyping technique for simulating realistic social interactions in social computing systems is a novel contribution. The use of large language models to generate distinct community members and their interactions is also a unique approach.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design and implementation of the 'Social Simulacra' technique and how large language models are prompted to generate social interactions. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of AI and social computing systems.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents a novel and intriguing contribution to the field of social computing systems. The use of large language models to simulate social interactions is particularly interesting, making the paper an enjoyable read.", "enjoyable_score": 3}