{"Published": "2022-10-04", "Title": "Robot Task Planning and Situation Handling in Open Worlds", "Authors": "Yan Ding, Xiaohan Zhang, Saeid Amiri, Nieqing Cao, Hao Yang, Chad Esselink, Shiqi Zhang", "Summary": "Automated task planning algorithms have been developed to help robots complete complex tasks that require multiple actions. Most of those algorithms have been developed for \"closed worlds\" assuming complete world knowledge is provided. However, the real world is generally open, and the robots frequently encounter unforeseen situations that can potentially break the planner's completeness. This paper introduces a novel algorithm (COWP) for open-world task planning and situation handling that dynamically augments the robot's action knowledge with task-oriented common sense. In particular, common sense is extracted from Large Language Models based on the current task at hand and robot skills. For systematic evaluations, we collected a dataset that includes 561 execution-time situations in a dining domain, where each situation corresponds to a state instance of a robot being potentially unable to complete a task using a solution that normally works. Experimental results show that our approach significantly outperforms competitive baselines from the literature in the success rate of service tasks. Additionally, we have demonstrated COWP using a mobile manipulator. Supplementary materials are available at: https://cowplanning.github.io/", "main_contribution": "The paper presents a novel algorithm, COWP, for open-world task planning and situation handling in robotics. The algorithm dynamically augments the robot's action knowledge with task-oriented common sense, which is extracted from Large Language Models (LLMs) based on the current task and robot skills. The authors have collected a dataset of 561 execution-time situations in a dining domain for evaluation, demonstrating the effectiveness of the approach.", "takeaways": "The COWP algorithm offers a significant advancement in open-world task planning for robots, enabling them to handle unforeseen situations more effectively. By leveraging LLMs to extract task-oriented common sense, the algorithm enhances the robot's ability to adapt to real-world scenarios. This approach could have significant implications for the development of more robust and adaptable robotic systems.", "novelty_analysis": "The paper presents a novel approach to open-world task planning in robotics, introducing an algorithm that leverages LLMs to enhance the robot's action knowledge. This represents a significant departure from traditional closed-world assumptions in robotic task planning, offering a more adaptable and robust solution.", "novelty_score": 3, "category": "USE CASES", "technical_analysis": "The paper is somewhat technical, introducing a new algorithm and discussing its implementation in a specific domain. However, the concepts are explained clearly, making it accessible to readers with a background in AI and robotics.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field of robotics. However, the highly specific domain and technical content may limit its appeal to a broader audience.", "enjoyable_score": 2}