{"Published": "2022-03-10", "Title": "Connecting Neural Response measurements & Computational Models of language: a non-comprehensive guide", "Authors": "Mostafa Abdou", "Summary": "Understanding the neural basis of language comprehension in the brain has been a long-standing goal of various scientific research programs. Recent advances in language modelling and in neuroimaging methodology promise potential improvements in both the investigation of language's neurobiology and in the building of better and more human-like language models. This survey traces a line from early research linking Event Related Potentials and complexity measures derived from simple language models to contemporary studies employing Artificial Neural Network models trained on large corpora in combination with neural response recordings from multiple modalities using naturalistic stimuli.", "main_contribution": "The paper provides a comprehensive survey of research linking computational models of language with neural response measurements. It traces the evolution of this field from early studies using Event Related Potentials and complexity measures derived from simple language models to contemporary research employing Artificial Neural Network models trained on large corpora. The paper does not introduce a new algorithm or technique, but rather provides a detailed overview of the existing literature in the field.", "takeaways": "The paper offers a valuable resource for researchers and practitioners interested in the intersection of computational language models and neurobiology. It provides a detailed overview of the field, highlighting key studies and advancements. This could help practitioners understand the evolution of the field and identify potential areas for future research or application.", "novelty_analysis": "The paper does not present new findings or techniques, but rather compiles and reviews existing research in the field. The novelty lies in the comprehensive and detailed overview it provides, which could serve as a valuable resource for researchers and practitioners.", "novelty_score": 1, "category": "BEHAVIOR", "technical_analysis": "The paper is somewhat technical, as it requires a basic understanding of computational language models and neurobiology. However, it is primarily a literature review, so it does not delve into the technical details of specific algorithms or techniques.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and provides a comprehensive overview of a complex and rapidly evolving field. However, its focus on reviewing existing literature rather than presenting new findings or techniques may limit its appeal to some readers.", "enjoyable_score": 2}