{"Published": "2023-02-01", "Title": "Co-Writing with Opinionated Language Models Affects Users' Views", "Authors": "Maurice Jakesch, Advait Bhat, Daniel Buschek, Lior Zalmanson, Mor Naaman", "Summary": "If large language models like GPT-3 preferably produce a particular point of view, they may influence people's opinions on an unknown scale. This study investigates whether a language-model-powered writing assistant that generates some opinions more often than others impacts what users write - and what they think. In an online experiment, we asked participants (N=1,506) to write a post discussing whether social media is good for society. Treatment group participants used a language-model-powered writing assistant configured to argue that social media is good or bad for society. Participants then completed a social media attitude survey, and independent judges (N=500) evaluated the opinions expressed in their writing. Using the opinionated language model affected the opinions expressed in participants' writing and shifted their opinions in the subsequent attitude survey. We discuss the wider implications of our results and argue that the opinions built into AI language technologies need to be monitored and engineered more carefully.", "main_contribution": "The paper investigates the influence of opinionated language models on users' views and writing. It presents an online experiment where participants used a language-model-powered writing assistant configured to argue that social media is good or bad for society. The study found that the opinionated language model affected the opinions expressed in participants' writing and shifted their opinions in the subsequent attitude survey.", "takeaways": "The findings of this study highlight the potential for large language models to influence users' opinions, suggesting that the opinions built into AI language technologies need to be monitored and engineered more carefully. This has significant implications for the design and use of AI language technologies, particularly in areas where they may be used to shape public opinion or influence decision-making.", "novelty_analysis": "The study extends existing research by empirically demonstrating the influence of opinionated language models on users' views and writing. This is a significant contribution to our understanding of the potential impacts of AI language technologies on society.", "novelty_score": 3, "category": "BEHAVIOR", "technical_analysis": "The paper is not overly technical. It presents an online experiment and discusses its results, but does not delve into the technical details of the language models used. The focus is more on the social and behavioral implications of the technology.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and presents an interesting and important topic. The implications of the findings are clearly discussed, making it an engaging read for those interested in the societal impacts of AI.", "enjoyable_score": 3}