{"Published": "2023-07-26", "Title": "WavJourney: Compositional Audio Creation with Large Language Models", "Authors": "Xubo Liu, Zhongkai Zhu, Haohe Liu, Yi Yuan, Meng Cui, Qiushi Huang, Jinhua Liang, Yin Cao, Qiuqiang Kong, Mark D. Plumbley, Wenwu Wang", "Summary": "Large Language Models (LLMs) have shown great promise in integrating diverse expert models to tackle intricate language and vision tasks. Despite their significance in advancing the field of Artificial Intelligence Generated Content (AIGC), their potential in intelligent audio content creation remains unexplored. In this work, we tackle the problem of creating audio content with storylines encompassing speech, music, and sound effects, guided by text instructions. We present WavJourney, a system that leverages LLMs to connect various audio models for audio content generation. Given a text description of an auditory scene, WavJourney first prompts LLMs to generate a structured script dedicated to audio storytelling. The audio script incorporates diverse audio elements, organized based on their spatio-temporal relationships. As a conceptual representation of audio, the audio script provides an interactive and interpretable rationale for human engagement. Afterward, the audio script is fed into a script compiler, converting it into a computer program. Each line of the program calls a task-specific audio generation model or computational operation function (e.g., concatenate, mix). The computer program is then executed to obtain an explainable solution for audio generation. We demonstrate the practicality of WavJourney across diverse real-world scenarios, including science fiction, education, and radio play. The explainable and interactive design of WavJourney fosters human-machine co-creation in multi-round dialogues, enhancing creative control and adaptability in audio production. WavJourney audiolizes the human imagination, opening up new avenues for creativity in multimedia content creation.", "main_contribution": {"headline": "WavJourney: Compositional Audio Creation with Large Language Models", "description": "The paper introduces WavJourney, a system that leverages Large Language Models (LLMs) to generate audio content based on text instructions. WavJourney prompts LLMs to generate a structured script dedicated to audio storytelling, incorporating diverse audio elements such as speech, music, and sound effects. The audio script is then fed into a script compiler, converting it into a computer program. Each line of the program calls a task-specific audio generation model or computational operation function (e.g., concatenate, mix). The computer program is then executed to obtain an explainable solution for audio generation. The system demonstrates practicality across diverse real-world scenarios, including science fiction, education, and radio play. The explainable and interactive design of WavJourney fosters human-machine co-creation in multi-round dialogues, enhancing creative control and adaptability in audio production."}, "takeaways": {"headline": "LLMs Can Be Leveraged for Compositional Audio Creation", "description": "WavJourney demonstrates the potential of LLMs in intelligent audio content creation. Given a text description of an auditory scene, the system can generate a structured script that incorporates diverse audio elements. The generated script is then converted into a computer program, which calls various audio generation models or computational operation functions to create the final audio content. This approach allows for the creation of rich and dynamic audio content from text instructions, opening up new avenues for creativity in multimedia content creation. The system's design also facilitates human-machine co-creation, enhancing creative control and adaptability in audio production.", "example": "For instance, given a text description of a science fiction scenario, WavJourney can generate a script that includes speech, music, and sound effects relevant to the scenario. This script is then compiled into a computer program, which when executed, produces the final audio content. The system also allows for interactive modifications to the script, enabling users to customize the audio content according to their preferences."}, "category": "USE CASES", "novelty_analysis": "WavJourney presents a novel application of LLMs in the field of audio content creation. While LLMs have been extensively used for language and vision tasks, their potential in audio content creation has been relatively unexplored. WavJourney fills this gap by demonstrating how LLMs can be leveraged to generate audio content from text instructions, offering a new perspective on the capabilities of LLMs.", "novelty_score": 3, "technical_analysis": "The paper presents a detailed description of the WavJourney system, including its architecture and the process of generating audio content. It delves into the technical aspects of using LLMs for audio script generation and the subsequent conversion of these scripts into computer programs. However, the paper maintains a balance between technical depth and accessibility, making it comprehensible to readers with a basic understanding of LLMs and audio content generation.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of LLMs in a novel domain. The use of real-world scenarios to demonstrate the practicality of WavJourney makes the paper engaging. The clear explanation of the system's architecture and the process of audio content generation enhances the readability of the paper.", "enjoyable_score": 2}