{"Published": "2023-08-06", "Title": "Pre-Trained Large Language Models for Industrial Control", "Authors": "Lei Song, Chuheng Zhang, Li Zhao, Jiang Bian", "Summary": "For industrial control, developing high-performance controllers with few samples and low technical debt is appealing. Foundation models, possessing rich prior knowledge obtained from pre-training with Internet-scale corpus, have the potential to be a good controller with proper prompts. In this paper, we take HVAC (Heating, Ventilation, and Air Conditioning) building control as an example to examine the ability of GPT-4 (one of the first-tier foundation models) as the controller. To control HVAC, we wrap the task as a language game by providing text including a short description for the task, several selected demonstrations, and the current observation to GPT-4 on each step and execute the actions responded by GPT-4. We conduct series of experiments to answer the following questions: 1)~How well can GPT-4 control HVAC? 2)~How well can GPT-4 generalize to different scenarios for HVAC control? 3) How different parts of the text context affect the performance? In general, we found GPT-4 achieves the performance comparable to RL methods with few samples and low technical debt, indicating the potential of directly applying foundation models to industrial control tasks.", "main_contribution": {"headline": "GPT-4 Shows Promise in Industrial Control Tasks", "description": "The paper explores the potential of Large Language Models (LLMs), specifically GPT-4, in industrial control tasks, using Heating, Ventilation, and Air Conditioning (HVAC) control as an example. The authors design mechanisms to select demonstrations and generate prompts for GPT-4, and then execute the actions given by the model. The study found that GPT-4 achieves performance comparable to Reinforcement Learning (RL) methods but with fewer samples and lower technical debt. This indicates the potential of directly applying foundation models to industrial control tasks. The paper also provides extended ablation studies on the generalization ability, demonstration selection, and prompt design to guide future research in this direction."}, "takeaways": {"headline": "LLMs Can Be Effectively Applied to Industrial Control Tasks", "description": "The paper demonstrates that Large Language Models (LLMs), such as GPT-4, can be effectively applied to industrial control tasks, such as HVAC control, with performance comparable to traditional Reinforcement Learning (RL) methods. This approach requires fewer samples and incurs lower technical debt, making it a promising alternative for industrial control. The authors also provide insights into how different designs, such as demonstration selection and prompt design, can influence the performance of LLMs in industrial control tasks. This research opens up new possibilities for the application of LLMs in industrial scenarios.", "example": "For instance, in an industrial scenario where we need to control the HVAC system for different buildings, we can use GPT-4 as the controller. We provide GPT-4 with a prompt that includes a description of the current state, simple HVAC control instructions, and several selected demonstrations. GPT-4 then generates the control actions based on the given prompt. This approach can be applied to other industrial control tasks, potentially improving efficiency and reducing technical debt."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel application of Large Language Models (LLMs) in the field of industrial control, specifically for HVAC control. The authors' approach of using GPT-4 as a controller, guided by carefully designed prompts and demonstrations, is a unique contribution. The comparative study of GPT-4's performance with traditional RL methods in this specific application is also a novel aspect of this work.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design of prompts and demonstrations for GPT-4, and the use of reinforcement learning methods for comparison. However, the authors explain these concepts clearly, making the paper accessible to readers with a basic understanding of machine learning and control systems.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of Large Language Models in industrial control. The authors' approach of using GPT-4 for HVAC control and their detailed analysis of its performance make for an engaging read. The paper also provides valuable insights for researchers and practitioners interested in the application of LLMs in industrial scenarios.", "enjoyable_score": 3}