{"Published": "2023-07-31", "Title": "ToolLLM: Facilitating Large Language Models to Master 16000+ Real-world APIs", "Authors": "Yujia Qin, Shihao Liang, Yining Ye, Kunlun Zhu, Lan Yan, Yaxi Lu, Yankai Lin, Xin Cong, Xiangru Tang, Bill Qian, Sihan Zhao, Runchu Tian, Ruobing Xie, Jie Zhou, Mark Gerstein, Dahai Li, Zhiyuan Liu, Maosong Sun", "Summary": "Despite the advancements of open-source large language models (LLMs) and their variants, e.g., LLaMA and Vicuna, they remain significantly limited in performing higher-level tasks, such as following human instructions to use external tools (APIs). This is because current instruction tuning largely focuses on basic language tasks instead of the tool-use domain. This is in contrast to state-of-the-art (SOTA) LLMs, e.g., ChatGPT, which have demonstrated excellent tool-use capabilities but are unfortunately closed source. To facilitate tool-use capabilities within open-source LLMs, we introduce ToolLLM, a general tool-use framework of data construction, model training and evaluation. We first present ToolBench, an instruction-tuning dataset for tool use, which is created automatically using ChatGPT. Specifically, we collect 16,464 real-world RESTful APIs spanning 49 categories from RapidAPI Hub, then prompt ChatGPT to generate diverse human instructions involving these APIs, covering both single-tool and multi-tool scenarios. Finally, we use ChatGPT to search for a valid solution path (chain of API calls) for each instruction. To make the searching process more efficient, we develop a novel depth-first search-based decision tree (DFSDT), enabling LLMs to evaluate multiple reasoning traces and expand the search space. We show that DFSDT significantly enhances the planning and reasoning capabilities of LLMs. For efficient tool-use assessment, we develop an automatic evaluator: ToolEval. We fine-tune LLaMA on ToolBench and obtain ToolLLaMA. Our ToolEval reveals that ToolLLaMA demonstrates a remarkable ability to execute complex instructions and generalize to unseen APIs, and exhibits comparable performance to ChatGPT. To make the pipeline more practical, we devise a neural API retriever to recommend appropriate APIs for each instruction, negating the need for manual API selection.", "main_contribution": {"headline": "ToolLLM: A Framework for Enhancing Tool-Use Capabilities of Open-Source LLMs", "description": "The paper introduces ToolLLM, a comprehensive framework designed to enhance the tool-use capabilities of open-source Large Language Models (LLMs). The authors present ToolBench, an instruction-tuning dataset for tool use, created using ChatGPT. They also introduce a novel depth-first search-based decision tree (DFSDT) to make the search process for valid solution paths more efficient. Furthermore, they develop an automatic evaluator, ToolEval, for efficient tool-use assessment. The framework is demonstrated by fine-tuning LLaMA on ToolBench to create ToolLLaMA, which shows remarkable ability to execute complex instructions and generalize to unseen APIs."}, "takeaways": {"headline": "ToolLLM Framework Opens New Avenues for LLMs in API Interaction", "description": "The ToolLLM framework presents a significant advancement in enabling LLMs to interact with APIs, thereby expanding their utility in real-world applications. The framework's components, including ToolBench, DFSDT, and ToolEval, provide a comprehensive solution for enhancing LLMs' tool-use capabilities. This could be particularly useful for developers and AI practitioners looking to leverage LLMs for tasks involving API interaction. The framework's ability to generalize to unseen APIs also suggests potential for scalable and adaptable applications.", "example": "For instance, an LLM trained with ToolLLM could be used to build a chatbot that not only understands and responds to user queries but also interacts with various APIs to perform tasks like booking flights, fetching weather data, or making restaurant reservations, based on user instructions."}, "category": "FINE-TUNING", "novelty_analysis": "The paper presents a novel framework, ToolLLM, which addresses a significant gap in the capabilities of open-source LLMs - their ability to interact with APIs. The introduction of ToolBench, DFSDT, and ToolEval as components of this framework represents a unique and significant contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is quite technical, delving into the details of the ToolLLM framework, the creation of the ToolBench dataset, the workings of the DFSDT, and the development of the ToolEval evaluator. It requires a good understanding of LLMs, APIs, and search algorithms.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents an interesting and significant contribution to the field of LLMs. However, the high level of technical detail might make it a challenging read for those without a strong background in the field.", "enjoyable_score": 2}