{"Published": "2023-04-26", "Title": "GrIPS: Gradient-free, Edit-based Instruction Search for Prompting Large Language Models", "Authors": "Archiki Prasad, Peter Hase, Xiang Zhou, Mohit Bansal", "Summary": "Providing natural language instructions in prompts is a useful new paradigm for improving task performance of large language models in a zero-shot setting. Recent work has aimed to improve such prompts via manual rewriting or gradient-based tuning. However, manual rewriting is time-consuming and requires subjective interpretation, while gradient-based tuning can be extremely computationally demanding for large models and may not be feasible for API-based models. In this work, we introduce Gradient-free Instructional Prompt Search (GrIPS), a gradient-free, edit-based search approach for improving task instructions for large language models. GrIPS takes in instructions designed for humans and automatically returns an improved, edited prompt, while allowing for API-based tuning. With InstructGPT models, GrIPS improves the average task performance by up to 4.30 percentage points on eight classification tasks from the Natural Instructions dataset (with similar improvements for OPT, BLOOM, and FLAN-T5). We see improvements for both instruction-only prompts and instruction + k-shot examples prompts. Notably, GrIPS outperforms manual rewriting and purely example-based prompts while controlling for the available compute and data budget. Further, performance of GrIPS is comparable to select gradient-based tuning approaches. Qualitatively, we show our edits can simplify instructions and at times make them incoherent but nonetheless improve accuracy. Our code is available at: https://github.com/archiki/GrIPS", "main_contribution": {"headline": "Introduction of GRIPS: A Gradient-free, Edit-based Instruction Search for Prompting Large Language Models", "description": "The paper introduces Gradient-free Instructional Prompt Search (GRIPS), a novel method for improving task instructions for large language models (LLMs). GRIPS is a gradient-free, edit-based search approach that takes in human-designed instructions and automatically returns an improved, edited prompt. This method allows for API-based tuning, making it feasible for models available only via APIs. GRIPS outperforms manual rewriting and purely example-based prompts while controlling for the available compute and data budget. It also shows comparable performance to select gradient-based tuning approaches."}, "takeaways": {"headline": "GRIPS offers an efficient and effective method for improving LLM task instructions", "description": "GRIPS provides a practical solution for improving task instructions for LLMs, especially in a zero-shot setting. It automates the process of prompt improvement, reducing the time and effort required for manual rewriting. Furthermore, it allows for API-based tuning, making it applicable even for models available only via APIs. The method can be used to enhance the performance of LLMs across various tasks, as demonstrated by its effectiveness on eight classification tasks from the Natural Instructions dataset.", "example": "For instance, if you have an LLM designed for a specific task, you can use GRIPS to automatically improve the task instructions. You input the original instructions into GRIPS, and it returns an improved, edited prompt that can enhance the model's performance on the task."}, "category": "PROMPTING", "novelty_analysis": "The introduction of GRIPS represents a significant advancement in the field of prompting for LLMs. It offers a novel, gradient-free, and edit-based approach to improving task instructions, which is particularly beneficial for models available only via APIs. This makes it a unique contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it introduces a new method for improving task instructions for LLMs. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and prompting techniques.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of LLM prompting. The introduction of GRIPS and its potential applications make the paper an interesting read. However, the technical nature of the content might pose a challenge for readers without a background in the field.", "enjoyable_score": 2}