{"Published": "2023-03-30", "Title": "LLM-Planner: Few-Shot Grounded Planning for Embodied Agents with Large Language Models", "Authors": "Chan Hee Song, Jiaman Wu, Clayton Washington, Brian M. Sadler, Wei-Lun Chao, Yu Su", "Summary": "This study focuses on using large language models (LLMs) as a planner for embodied agents that can follow natural language instructions to complete complex tasks in a visually-perceived environment. The high data cost and poor sample efficiency of existing methods hinders the development of versatile agents that are capable of many tasks and can learn new tasks quickly. In this work, we propose a novel method, LLM-Planner, that harnesses the power of large language models to do few-shot planning for embodied agents. We further propose a simple but effective way to enhance LLMs with physical grounding to generate and update plans that are grounded in the current environment. Experiments on the ALFRED dataset show that our method can achieve very competitive few-shot performance: Despite using less than 0.5% of paired training data, LLM-Planner achieves competitive performance with recent baselines that are trained using the full training data. Existing methods can barely complete any task successfully under the same few-shot setting. Our work opens the door for developing versatile and sample-efficient embodied agents that can quickly learn many tasks. Website: https://dki-lab.github.io/LLM-Planner", "main_contribution": {"headline": "LLM-Planner: A novel method for few-shot grounded planning for embodied agents", "description": "The paper introduces LLM-Planner, a novel method that leverages large language models (LLMs) for few-shot planning for embodied agents. Embodied agents are AI systems that interact with the environment through a physical body within that environment. The LLM-Planner is designed to follow natural language instructions to complete complex tasks in a visually-perceived environment. The authors propose a simple yet effective way to enhance LLMs with physical grounding, allowing the generation and updating of plans that are grounded in the current environment. This approach significantly reduces the data cost and improves the sample efficiency of existing methods."}, "takeaways": {"headline": "LLM-Planner offers a new approach to few-shot planning for embodied agents", "description": "The LLM-Planner presents a promising approach for AI practitioners working on embodied agents. It demonstrates how LLMs can be used for few-shot planning, reducing the need for large amounts of training data. The method also introduces a way to physically ground the LLMs, allowing them to generate and update plans based on the current environment. This could be particularly useful in applications such as robotics, where agents need to adapt to changing environments and perform tasks based on natural language instructions.", "example": "For instance, an embodied agent like a robot could use the LLM-Planner to understand and execute a command like 'pick up the red ball and place it in the blue box'. The LLM-Planner would generate a plan based on this instruction, and if the environment changes (e.g., the ball moves), it could update the plan accordingly."}, "category": "TRAINING", "novelty_analysis": "The paper presents a novel approach to few-shot planning for embodied agents using large language models. The introduction of physical grounding to enhance LLMs and the demonstrated success of the LLM-Planner in a few-shot setting represent significant advancements in the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design and implementation of the LLM-Planner and its application to embodied agents. It requires a basic understanding of large language models and embodied agents, but does not delve into complex mathematical theories or algorithms.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of large language models. The introduction of the LLM-Planner and its potential applications in the field of embodied agents make it an engaging read for those interested in this area of research.", "enjoyable_score": 2}