{"Published": "2023-07-03", "Title": "Prompt Middleware: Mapping Prompts for Large Language Models to UI Affordances", "Authors": "Stephen MacNeil, Andrew Tran, Joanne Kim, Ziheng Huang, Seth Bernstein, Dan Mogil", "Summary": "To help users do complex work, researchers have developed techniques to integrate AI and human intelligence into user interfaces (UIs). With the recent introduction of large language models (LLMs), which can generate text in response to a natural language prompt, there are new opportunities to consider how to integrate LLMs into UIs. We present Prompt Middleware, a framework for generating prompts for LLMs based on UI affordances. These include prompts that are predefined by experts (static prompts), generated from templates with fill-in options in the UI (template-based prompts), or created from scratch (free-form prompts). We demonstrate this framework with FeedbackBuffet, a writing assistant that automatically generates feedback based on a user's text input. Inspired by prior research showing how templates can help non-experts perform more like experts, FeedbackBuffet leverages template-based prompt middleware to enable feedback seekers to specify the types of feedback they want to receive as options in a UI. These options are composed using a template to form a feedback request prompt to GPT-3. We conclude with a discussion about how Prompt Middleware can help developers integrate LLMs into UIs.", "main_contribution": "The paper introduces a new framework, Prompt Middleware, for generating prompts for Large Language Models (LLMs) based on User Interface (UI) affordances. The framework includes three types of prompts: static prompts predefined by experts, template-based prompts generated from fill-in options in the UI, and free-form prompts created from scratch. The authors demonstrate the application of this framework through FeedbackBuffet, a writing assistant that generates feedback based on user's text input.", "takeaways": "The Prompt Middleware framework provides a structured approach to integrate LLMs into UIs, offering a variety of prompt types to cater to different user needs and contexts. The demonstration through FeedbackBuffet shows the practical application of this framework, enabling users to specify the types of feedback they want to receive as options in a UI. This could potentially simplify the process of integrating LLMs into UIs for developers.", "novelty_analysis": "The introduction of the Prompt Middleware framework is a novel contribution to the field, providing a structured approach to generate prompts for LLMs based on UI affordances. The demonstration through FeedbackBuffet further illustrates the practical application of this framework.", "novelty_score": 3, "category": "PROMPTING", "technical_analysis": "The paper is moderately technical, introducing a new framework and demonstrating its application. However, it does not delve deeply into the technical details of the LLMs or the UI design, making it accessible to readers with a basic understanding of these areas.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field. The demonstration through FeedbackBuffet adds a practical aspect, making it an enjoyable read.", "enjoyable_score": 3}