{"Published": "2023-08-07", "Title": "MetaGPT: Meta Programming for Multi-Agent Collaborative Framework", "Authors": "Sirui Hong, Xiawu Zheng, Jonathan Chen, Yuheng Cheng, Jinlin Wang, Ceyao Zhang, Zili Wang, Steven Ka Shing Yau, Zijuan Lin, Liyang Zhou, Chenyu Ran, Lingfeng Xiao, Chenglin Wu", "Summary": "Recently, remarkable progress has been made in automated task-solving through the use of multi-agent driven by large language models (LLMs). However, existing LLM-based multi-agent works primarily focus on solving simple dialogue tasks, and complex tasks are rarely studied, mainly due to the LLM hallucination problem. This type of hallucination becomes cascading when naively chaining multiple intelligent agents, resulting in a failure to effectively address complex problems. Therefore, we introduce MetaGPT, an innovative framework that incorporates efficient human workflows as a meta programming approach into LLM-based multi-agent collaboration. Specifically, MetaGPT encodes Standardized Operating Procedures (SOPs) into prompts to enhance structured coordination. Subsequently, it mandates modular outputs, empowering agents with domain expertise comparable to human professionals, to validate outputs and minimize compounded errors. In this way, MetaGPT leverages the assembly line paradigm to assign diverse roles to various agents, thereby establishing a framework that can effectively and cohesively deconstruct complex multi-agent collaborative problems. Our experiments on collaborative software engineering benchmarks demonstrate that MetaGPT generates more coherent and correct solutions compared to existing chat-based multi-agent systems. This highlights the potential of integrating human domain knowledge into multi-agent systems, thereby creating new opportunities to tackle complex real-world challenges. The GitHub repository of this project is publicly available on:https://github.com/geekan/MetaGPT.", "main_contribution": {"headline": "MetaGPT: A Meta Programming Framework for LLM-based Multi-Agent Collaboration", "description": "The paper introduces MetaGPT, a novel framework that incorporates human workflows as a meta programming approach into Large Language Model (LLM)-based multi-agent collaboration. The framework encodes Standardized Operating Procedures (SOPs) into prompts to enhance structured coordination among agents. It mandates modular outputs, allowing agents with domain expertise to validate outputs and minimize compounded errors. MetaGPT leverages the assembly line paradigm to assign diverse roles to various agents, thereby establishing a framework that can effectively and cohesively deconstruct complex multi-agent collaborative problems. The authors demonstrate that MetaGPT generates more coherent and correct solutions compared to existing chat-based multi-agent systems, highlighting the potential of integrating human domain knowledge into multi-agent systems."}, "takeaways": {"headline": "MetaGPT: A New Paradigm for LLM-based Multi-Agent Systems", "description": "MetaGPT presents a new paradigm for designing and organizing LLM-based multi-agent systems. By integrating SOPs, it enhances the effectiveness and applicability of these systems. The framework allows for the creation of various specialized role classes, such as ProductManager, Architect, and others, which inherit from the base Role class. Each role is characterized by a set of key attributes: name, profile, goal, constraints, and description. The framework also institutes essential mechanisms for cooperation: Knowledge Sharing and Encapsulating Workflows. The authors demonstrate the effectiveness of their design by showcasing the collaborative software development workflow and conducting experiments to implement the associated code.", "example": "For instance, in a software development project, MetaGPT can assign different roles to various agents, such as ProductManager, Architect, ProjectManager, Engineer, QA Engineer. Each agent can then perform its tasks based on the SOPs, and the outputs are validated by other agents with domain expertise. This approach can significantly increase the success rate of the final code execution."}, "category": "ARCHITECTURES", "novelty_analysis": "The introduction of MetaGPT represents a significant advancement in the field of LLM-based multi-agent systems. The framework's unique approach of integrating SOPs into the system's design and its ability to systematically engineer solutions for complex tasks demonstrate a high degree of novelty.", "novelty_score": 3, "technical_analysis": "The paper is highly technical, delving into the intricate design of the MetaGPT framework and its core components. It discusses advanced concepts such as meta programming, Standardized Operating Procedures, and the assembly line paradigm in the context of LLM-based multi-agent systems.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and provides a comprehensive overview of the MetaGPT framework. The authors' clear explanation of the framework's design and its potential applications make it an engaging read for those interested in LLM-based multi-agent systems.", "enjoyable_score": 2}