{"Published": "2023-07-04", "Title": "Robots That Ask For Help: Uncertainty Alignment for Large Language Model Planners", "Authors": "Allen Z. Ren, Anushri Dixit, Alexandra Bodrova, Sumeet Singh, Stephen Tu, Noah Brown, Peng Xu, Leila Takayama, Fei Xia, Jake Varley, Zhenjia Xu, Dorsa Sadigh, Andy Zeng, Anirudha Majumdar", "Summary": "Large language models (LLMs) exhibit a wide range of promising capabilities -- from step-by-step planning to commonsense reasoning -- that may provide utility for robots, but remain prone to confidently hallucinated predictions. In this work, we present KnowNo, which is a framework for measuring and aligning the uncertainty of LLM-based planners such that they know when they don't know and ask for help when needed. KnowNo builds on the theory of conformal prediction to provide statistical guarantees on task completion while minimizing human help in complex multi-step planning settings. Experiments across a variety of simulated and real robot setups that involve tasks with different modes of ambiguity (e.g., from spatial to numeric uncertainties, from human preferences to Winograd schemas) show that KnowNo performs favorably over modern baselines (which may involve ensembles or extensive prompt tuning) in terms of improving efficiency and autonomy, while providing formal assurances. KnowNo can be used with LLMs out of the box without model-finetuning, and suggests a promising lightweight approach to modeling uncertainty that can complement and scale with the growing capabilities of foundation models. Website: https://robot-help.github.io", "main_contribution": {"headline": "KNOWNO: A Framework for Aligning Uncertainty in LLM-based Planners", "description": "The paper introduces KNOWNO, a framework that measures and aligns the uncertainty of Large Language Model (LLM)-based planners, enabling them to recognize when they don't know something and ask for help. The framework leverages the theory of conformal prediction to provide statistical guarantees on task completion while minimizing human intervention in complex multi-step planning settings. The authors demonstrate how KNOWNO can be used with LLMs without model fine-tuning, offering a lightweight approach to modeling uncertainty that can scale with the growing capabilities of foundation models. The framework was tested across a variety of simulated and real robot setups involving tasks with different types of ambiguity, showing improved efficiency and autonomy over modern baselines."}, "takeaways": {"headline": "KNOWNO Enhances Efficiency and Autonomy in LLM-based Planners", "description": "KNOWNO provides a promising approach to handle uncertainty in LLM-based planners, particularly in robotics. By aligning the uncertainty of these planners, KNOWNO ensures that they can recognize when they don't know something and ask for help, thereby improving efficiency and autonomy. This approach can be particularly useful in real-world applications where instructions often contain a high degree of ambiguity. The framework can be used with LLMs out of the box, suggesting a scalable solution to modeling uncertainty.", "example": "For instance, in a scenario where a robot is tasked with heating food and is instructed to 'place the bowl in the microwave', but there are multiple bowls on the counter, the instruction is ambiguous. Using KNOWNO, the robot can recognize this ambiguity and ask for clarification (e.g., ask which bowl should be placed in the microwave), thereby avoiding potential damage or unsafe actions."}, "category": "USE CASES", "novelty_analysis": "The introduction of KNOWNO represents a significant advancement in the field of LLM-based planning. The framework's ability to align uncertainty and provide statistical guarantees on task completion while minimizing human intervention is a novel approach to handling uncertainty in LLMs.", "novelty_score": 3, "technical_analysis": "The paper is highly technical, delving into the theory of conformal prediction and its application in the KNOWNO framework. It requires a solid understanding of LLMs, robotics, and statistical methods to fully grasp the concepts and methodologies presented.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and provides a comprehensive overview of the KNOWNO framework, its theoretical underpinnings, and its application in various scenarios. The use of real-world examples and clear explanations of complex concepts make it an engaging read for those with a technical background.", "enjoyable_score": 2}