{"Published": "2023-03-29", "Title": "Translating Radiology Reports into Plain Language using ChatGPT and GPT-4 with Prompt Learning: Promising Results, Limitations, and Potential", "Authors": "Qing Lyu, Josh Tan, Michael E. Zapadka, Janardhana Ponnatapura, Chuang Niu, Kyle J. Myers, Ge Wang, Christopher T. Whitlow", "Summary": "The large language model called ChatGPT has drawn extensively attention because of its human-like expression and reasoning abilities. In this study, we investigate the feasibility of using ChatGPT in experiments on using ChatGPT to translate radiology reports into plain language for patients and healthcare providers so that they are educated for improved healthcare. Radiology reports from 62 low-dose chest CT lung cancer screening scans and 76 brain MRI metastases screening scans were collected in the first half of February for this study. According to the evaluation by radiologists, ChatGPT can successfully translate radiology reports into plain language with an average score of 4.27 in the five-point system with 0.08 places of information missing and 0.07 places of misinformation. In terms of the suggestions provided by ChatGPT, they are general relevant such as keeping following-up with doctors and closely monitoring any symptoms, and for about 37% of 138 cases in total ChatGPT offers specific suggestions based on findings in the report. ChatGPT also presents some randomness in its responses with occasionally over-simplified or neglected information, which can be mitigated using a more detailed prompt. Furthermore, ChatGPT results are compared with a newly released large model GPT-4, showing that GPT-4 can significantly improve the quality of translated reports. Our results show that it is feasible to utilize large language models in clinical education, and further efforts are needed to address limitations and maximize their potential.", "main_contribution": "The paper investigates the use of large language models, specifically ChatGPT and GPT-4, in translating radiology reports into plain language for patients and healthcare providers. The authors collected radiology reports from chest CT lung cancer screening scans and brain MRI metastases screening scans, and evaluated the performance of the models in translating these reports. The study also compared the performance of ChatGPT with the newly released GPT-4, finding that GPT-4 significantly improved the quality of translated reports.", "takeaways": "The study demonstrates the potential of large language models in clinical education, specifically in translating complex radiology reports into understandable language for patients and healthcare providers. The use of these models could improve patient education and healthcare outcomes. However, the study also highlights the need for further efforts to address limitations and maximize the potential of these models, such as the occasional oversimplification or neglect of information in the translated reports.", "novelty_analysis": "The application of large language models in translating radiology reports into plain language is a novel contribution. While large language models have been used in various fields, their use in clinical education, specifically in the context of radiology reports, presents unique challenges and requires specific adaptations.", "novelty_score": 3, "category": "USE CASES", "technical_analysis": "The paper is somewhat technical, discussing the use of large language models in a specific application and providing an evaluation of their performance. However, the concepts are explained in a clear and understandable manner, making it accessible to readers with a background in computer science or AI.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of large language models. The results are insightful and have practical implications, making it an enjoyable read for those interested in the intersection of AI and healthcare.", "enjoyable_score": 3}