{"Published": "2023-03-23", "Title": "GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models", "Authors": "Tyna Eloundou, Sam Manning, Pamela Mishkin, Daniel Rock", "Summary": "We investigate the potential implications of large language models (LLMs), such as Generative Pre-trained Transformers (GPTs), on the U.S. labor market, focusing on the increased capabilities arising from LLM-powered software compared to LLMs on their own. Using a new rubric, we assess occupations based on their alignment with LLM capabilities, integrating both human expertise and GPT-4 classifications. Our findings reveal that around 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of LLMs, while approximately 19% of workers may see at least 50% of their tasks impacted. We do not make predictions about the development or adoption timeline of such LLMs. The projected effects span all wage levels, with higher-income jobs potentially facing greater exposure to LLM capabilities and LLM-powered software. Significantly, these impacts are not restricted to industries with higher recent productivity growth. Our analysis suggests that, with access to an LLM, about 15% of all worker tasks in the US could be completed significantly faster at the same level of quality. When incorporating software and tooling built on top of LLMs, this share increases to between 47 and 56% of all tasks. This finding implies that LLM-powered software will have a substantial effect on scaling the economic impacts of the underlying models. We conclude that LLMs such as GPTs exhibit traits of general-purpose technologies, indicating that they could have considerable economic, social, and policy implications.", "main_contribution": "The paper presents a comprehensive analysis of the potential impact of Large Language Models (LLMs) on the U.S. labor market. The authors develop a new rubric to assess occupations based on their alignment with LLM capabilities, integrating both human expertise and GPT-4 classifications. The paper also discusses the role of complementary technologies in maximizing the impact of LLMs.", "takeaways": "The paper provides valuable insights into the potential implications of LLMs on the workforce. It suggests that LLMs could affect a significant portion of work tasks across all wage levels and industries, not just those with higher recent productivity growth. The paper also highlights the potential of LLM-powered software to scale the economic impacts of the underlying models, indicating that LLMs could have considerable economic, social, and policy implications.", "novelty_analysis": "The paper's focus on the labor market impact of LLMs is a novel approach in the field of AI research. The development of a new rubric to assess occupations based on their alignment with LLM capabilities is a unique contribution, providing a framework for future research on the societal implications of AI technologies.", "novelty_score": 3, "category": "BEHAVIOR", "technical_analysis": "The paper is not overly technical. It focuses more on the potential societal implications of LLMs rather than the technical aspects of these models. The authors use clear language and provide sufficient context to make the content accessible to a broad audience.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and provides a fresh perspective on the potential impacts of LLMs on the labor market. The authors' approach of integrating human expertise and GPT-4 classifications in their analysis adds depth to the discussion, making the paper an engaging read.", "enjoyable_score": 3}