{"Published": "2023-08-06", "Title": "Pre-Trained Large Language Models for Industrial Control", "Authors": "Lei Song, Chuheng Zhang, Li Zhao, Jiang Bian", "Summary": "For industrial control, developing high-performance controllers with few samples and low technical debt is appealing. Foundation models, possessing rich prior knowledge obtained from pre-training with Internet-scale corpus, have the potential to be a good controller with proper prompts. In this paper, we take HVAC (Heating, Ventilation, and Air Conditioning) building control as an example to examine the ability of GPT-4 (one of the first-tier foundation models) as the controller. To control HVAC, we wrap the task as a language game by providing text including a short description for the task, several selected demonstrations, and the current observation to GPT-4 on each step and execute the actions responded by GPT-4. We conduct series of experiments to answer the following questions: 1)~How well can GPT-4 control HVAC? 2)~How well can GPT-4 generalize to different scenarios for HVAC control? 3) How different parts of the text context affect the performance? In general, we found GPT-4 achieves the performance comparable to RL methods with few samples and low technical debt, indicating the potential of directly applying foundation models to industrial control tasks.", "main_contribution": {"headline": "Applying GPT-4 to Industrial Control Tasks: A Case Study with HVAC Systems", "description": "The paper explores the application of pre-trained Large Language Models (LLMs), specifically GPT-4, to industrial control tasks, using Heating, Ventilation, and Air Conditioning (HVAC) control as a case study. The authors design mechanisms to select demonstrations and generate prompts for the model, and then execute the actions given by the model. The study investigates how well GPT-4 can control HVAC systems, how well it can generalize to different scenarios, and how different designs affect performance. The results show that GPT-4 achieves performance comparable to Reinforcement Learning (RL) methods but with fewer samples and lower technical debt, indicating the potential of directly applying foundation models to industrial control tasks."}, "takeaways": {"headline": "GPT-4 Shows Promise in Industrial Control Tasks with Fewer Samples and Lower Technical Debt", "description": "The paper demonstrates that GPT-4, a pre-trained LLM, can be effectively applied to industrial control tasks, such as HVAC control, with performance comparable to traditional RL methods but with fewer samples and lower technical debt. This suggests that LLMs can be a viable alternative for industrial control tasks, potentially reducing the time and resources required for training and implementation. The study also provides insights into how to design prompts and select demonstrations for LLMs in such tasks.", "example": "To apply this in practice, one could wrap the industrial control task as a language game. For each step, provide GPT-4 with a text context that includes a short description of the task, several selected demonstrations, and the current observation. Then, execute the actions responded by GPT-4."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel application of pre-trained LLMs to industrial control tasks, which is a significant departure from traditional RL methods. The use of GPT-4 for HVAC control and the design of prompts and demonstrations for this purpose are unique contributions of this work.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the application of a pre-trained LLM to a specific industrial control task and the design of prompts and demonstrations. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and RL.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of LLMs to a real-world problem. The clear explanation of the approach and the detailed discussion of the results make it an enjoyable read for those interested in the practical applications of LLMs.", "enjoyable_score": 3}