{"Published": "2023-04-25", "Title": "A Preliminary Evaluation of ChatGPT in Requirements Information Retrieval", "Authors": "Jianzhang Zhang, Yiyang Chen, Nan Niu, Chuang Liu", "Summary": "Context: Recently, many illustrative examples have shown ChatGPT's impressive ability to perform programming tasks and answer general domain questions.   Objective: We empirically evaluate how ChatGPT performs on requirements analysis tasks to derive insights into how generative large language model, represented by ChatGPT, influence the research and practice of natural language processing for requirements engineering.   Method: We design an evaluation pipeline including two common requirements information retrieval tasks, four public datasets involving two typical requirements artifacts, querying ChatGPT with fixed task prompts, and quantitative and qualitative results analysis.   Results: Quantitative results show that ChatGPT achieves comparable or better $F\\beta$ values in all datasets under a zero-shot setting. Qualitative analysis further illustrates ChatGPT's powerful natural language processing ability and limited requirements engineering domain knowledge.   Conclusion: The evaluation results demonstrate ChatGPT' impressive ability to retrieve requirements information from different types artifacts involving multiple languages under a zero-shot setting. It is worthy for the research and industry communities to study generative large language model based requirements retrieval models and to develop corresponding tools.", "main_contribution": "The paper presents an empirical evaluation of ChatGPT's performance on requirements analysis tasks, specifically in the context of requirements engineering. The authors designed an evaluation pipeline that includes two common requirements information retrieval tasks, four public datasets, and querying ChatGPT with fixed task prompts. The evaluation provides insights into how generative large language models like ChatGPT can influence the research and practice of natural language processing for requirements engineering.", "takeaways": "The study shows that ChatGPT can achieve comparable or better performance in requirements information retrieval tasks under a zero-shot setting. This suggests that generative large language models like ChatGPT can be effectively used in requirements engineering, which could lead to the development of new tools and models for requirements retrieval. However, the study also highlights that ChatGPT has limited domain knowledge in requirements engineering, which could be a potential area for improvement.", "novelty_analysis": "While the use of large language models in various tasks has been explored in previous studies, this paper presents a novel application of ChatGPT in the field of requirements engineering. The empirical evaluation of ChatGPT's performance on requirements analysis tasks provides new insights into the potential of generative large language models in this domain.", "novelty_score": 2, "category": "USE CASES", "technical_analysis": "The paper is somewhat technical as it involves an empirical evaluation of ChatGPT's performance on specific tasks. It requires a basic understanding of natural language processing and requirements engineering to fully comprehend the study and its results.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of ChatGPT in requirements engineering. However, the technical nature of the study and the specific focus on requirements engineering might limit its appeal to a broader audience.", "enjoyable_score": 2}