{"Published": "2023-05-22", "Title": "Large language models effectively leverage document-level context for literary translation, but critical errors persist", "Authors": "Marzena Karpinska, Mohit Iyyer", "Summary": "Large language models (LLMs) are competitive with the state of the art on a wide range of sentence-level translation datasets. However, their ability to translate paragraphs and documents remains unexplored because evaluation in these settings is costly and difficult. We show through a rigorous human evaluation that asking the Gpt-3.5 (text-davinci-003) LLM to translate an entire literary paragraph (e.g., from a novel) at once results in higher-quality translations than standard sentence-by-sentence translation across 18 linguistically-diverse language pairs (e.g., translating into and out of Japanese, Polish, and English). Our evaluation, which took approximately 350 hours of effort for annotation and analysis, is conducted by hiring translators fluent in both the source and target language and asking them to provide both span-level error annotations as well as preference judgments of which system's translations are better. We observe that discourse-level LLM translators commit fewer mistranslations, grammar errors, and stylistic inconsistencies than sentence-level approaches. With that said, critical errors still abound, including occasional content omissions, and a human translator's intervention remains necessary to ensure that the author's voice remains intact. We publicly release our dataset and error annotations to spur future research on evaluation of document-level literary translation.", "main_contribution": {"headline": "GPT-3.5 excels in paragraph-level literary translation with fewer errors", "description": "The paper explores the ability of Large Language Models (LLMs), specifically GPT-3.5, to translate entire literary paragraphs, a task that has been largely unexplored due to the cost and difficulty of evaluation. The authors conducted a rigorous human evaluation across 18 linguistically-diverse language pairs and found that GPT-3.5 produces higher-quality translations when translating entire paragraphs at once, compared to sentence-by-sentence translation. The study reveals that GPT-3.5 commits fewer mistranslations, grammar errors, and stylistic inconsistencies when translating at the discourse level. However, it also highlights that critical errors, such as content omissions, still occur, necessitating human intervention."}, "takeaways": {"headline": "LLMs can be leveraged for higher-quality literary translation at the paragraph level", "description": "The paper's findings suggest that LLMs, like GPT-3.5, can be effectively used for translating entire literary paragraphs, resulting in fewer errors and higher-quality translations compared to sentence-by-sentence translation. This could be particularly useful in applications that involve translating large amounts of text, such as books or academic papers. However, practitioners should be aware of the potential for critical errors and the need for human intervention to ensure accuracy. The authors' dataset and error annotations, which they have publicly released, could be a valuable resource for further research and improvement in this area.", "example": "For instance, an LLM could be used to translate an entire chapter of a book at once, rather than sentence by sentence. This could result in a more coherent and accurate translation, although a human translator would still need to review the output for potential errors."}, "category": "USE CASES", "novelty_analysis": "The paper's exploration of LLMs' ability to translate entire literary paragraphs is a novel contribution to the field. While LLMs have been used for sentence-level translation, their use in translating larger amounts of text has been largely unexplored due to evaluation challenges.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it involves a detailed evaluation of LLMs' translation abilities and a discussion of the types of errors they make. However, it does not delve into complex algorithms or mathematical theories, making it accessible to readers with a basic understanding of LLMs and translation.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting exploration of a novel application of LLMs. The findings are clearly presented and the discussion of the implications is insightful, making it an enjoyable read for those interested in LLMs and translation.", "enjoyable_score": 3}