{"Published": "2023-05-21", "Title": "A PhD Student's Perspective on Research in NLP in the Era of Very Large Language Models", "Authors": "Oana Ignat, Zhijing Jin, Artem Abzaliev, Laura Biester, Santiago Castro, Naihao Deng, Xinyi Gao, Aylin Gunal, Jacky He, Ashkan Kazemi, Muhammad Khalifa, Namho Koh, Andrew Lee, Siyang Liu, Do June Min, Shinka Mori, Joan Nwatu, Veronica Perez-Rosas, Siqi Shen, Zekun Wang, Winston Wu, Rada Mihalcea", "Summary": "Recent progress in large language models has enabled the deployment of many generative NLP applications. At the same time, it has also led to a misleading public discourse that ``it's all been solved.'' Not surprisingly, this has in turn made many NLP researchers -- especially those at the beginning of their career -- wonder about what NLP research area they should focus on. This document is a compilation of NLP research directions that are rich for exploration, reflecting the views of a diverse group of PhD students in an academic research lab. While we identify many research areas, many others exist; we do not cover those areas that are currently addressed by LLMs but where LLMs lag behind in performance, or those focused on LLM development. We welcome suggestions for other research directions to include: https://bit.ly/nlp-era-llm", "main_contribution": {"headline": "Exploring Rich Areas of NLP Research Beyond Large Language Models", "description": "This paper, authored by a diverse group of PhD students, presents a comprehensive exploration of potential research areas in Natural Language Processing (NLP) that extend beyond the scope of Large Language Models (LLMs). The authors argue that despite the impressive advancements in LLMs, there are still many areas in NLP that are ripe for exploration. They identify several research directions that do not rely on LLMs, including multilinguality and low-resource languages, reasoning, and responsible reasoning in social contexts. The paper also discusses the need for a more robust formal reasoning, grounded reasoning in the physical real world, and the development of a proper evaluation framework for reasoning."}, "takeaways": {"headline": "Broadening the Scope of NLP Research Beyond LLMs", "description": "The paper emphasizes that there is much more to NLP than just LLMs. It encourages researchers, especially those at the beginning of their careers, to explore other rich areas of NLP that could lead to a PhD thesis and cover a space that is not within the purview of LLMs. The authors suggest that improving multilingual models, enhancing reasoning skills, and developing responsible reasoning in social contexts are promising research directions. They also highlight the need for a more robust formal reasoning, grounded reasoning in the physical real world, and the development of a proper evaluation framework for reasoning.", "example": "For instance, a researcher could focus on improving machine translation performance on low-resource languages, or developing multilingual models that work well for all languages. Another promising direction could be to explore ways to incorporate external knowledge sources, multimodal data, or simulated world scenarios to ground the reasoning skills of the models."}, "category": "BEHAVIOR", "novelty_analysis": "The paper provides a fresh perspective on the future of NLP research, emphasizing the need to explore areas beyond LLMs. While it does not introduce a new algorithm or technique, it offers a comprehensive exploration of potential research areas in NLP that extend beyond the scope of LLMs, which is a novel contribution to the field.", "novelty_score": 2, "technical_analysis": "The paper is not overly technical. It does not delve into complex mathematical theories or algorithms, but rather provides a high-level overview of potential research areas in NLP. It is accessible to a wide audience, including those without a deep technical background in NLP or LLMs.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and organized, presenting a clear and comprehensive exploration of potential research areas in NLP. It offers valuable insights for researchers, especially those at the beginning of their careers, making it an enjoyable and informative read.", "enjoyable_score": 3}