{"Published": "2023-05-20", "Title": "VNHSGE: VietNamese High School Graduation Examination Dataset for Large Language Models", "Authors": "Xuan-Quy Dao, Ngoc-Bich Le, The-Duy Vo, Xuan-Dung Phan, Bac-Bien Ngo, Van-Tien Nguyen, Thi-My-Thanh Nguyen, Hong-Phuoc Nguyen", "Summary": "The VNHSGE (VietNamese High School Graduation Examination) dataset, developed exclusively for evaluating large language models (LLMs), is introduced in this article. The dataset, which covers nine subjects, was generated from the Vietnamese National High School Graduation Examination and comparable tests. 300 literary essays have been included, and there are over 19,000 multiple-choice questions on a range of topics. The dataset assesses LLMs in multitasking situations such as question answering, text generation, reading comprehension, visual question answering, and more by including both textual data and accompanying images. Using ChatGPT and BingChat, we evaluated LLMs on the VNHSGE dataset and contrasted their performance with that of Vietnamese students to see how well they performed. The results show that ChatGPT and BingChat both perform at a human level in a number of areas, including literature, English, history, geography, and civics education. They still have space to grow, though, especially in the areas of mathematics, physics, chemistry, and biology. The VNHSGE dataset seeks to provide an adequate benchmark for assessing the abilities of LLMs with its wide-ranging coverage and variety of activities. We intend to promote future developments in the creation of LLMs by making this dataset available to the scientific community, especially in resolving LLMs' limits in disciplines involving mathematics and the natural sciences.", "main_contribution": "The paper introduces the VNHSGE dataset, a comprehensive resource for evaluating large language models (LLMs) across a variety of tasks and subjects. The dataset is derived from the Vietnamese National High School Graduation Examination and includes over 19,000 multiple-choice questions and 300 literary essays. It is designed to assess LLMs in multitasking situations, including question answering, text generation, reading comprehension, and visual question answering. The authors also provide a comparative analysis of LLMs' performance against that of Vietnamese students, highlighting areas of strength and potential improvement for the models.", "takeaways": "The VNHSGE dataset provides a valuable benchmark for assessing LLMs' abilities across a wide range of tasks and subjects. It can help identify areas where LLMs perform at a human level and those where they still need improvement. The dataset's wide coverage and variety of tasks make it a useful resource for future LLM development, particularly in addressing the models' limitations in disciplines involving mathematics and natural sciences.", "novelty_analysis": "The creation of the VNHSGE dataset is a novel contribution to the field of LLMs. The dataset's comprehensive coverage of subjects and tasks, its inclusion of both textual data and images, and its comparison of LLMs' performance with that of human students make it a unique resource for evaluating and improving LLMs.", "novelty_score": 3, "category": "USE CASES", "technical_analysis": "The paper is moderately technical, discussing the creation and use of a new dataset for evaluating LLMs. It requires some understanding of LLMs and their applications, but does not delve into complex technical details.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting and valuable contribution to the field of LLMs. The comparative analysis of LLMs' performance with that of human students adds an intriguing dimension to the study.", "enjoyable_score": 3}