{"Published": "2023-03-08", "Title": "Check Your Facts and Try Again: Improving Large Language Models with External Knowledge and Automated Feedback", "Authors": "Baolin Peng, Michel Galley, Pengcheng He, Hao Cheng, Yujia Xie, Yu Hu, Qiuyuan Huang, Lars Liden, Zhou Yu, Weizhu Chen, Jianfeng Gao", "Summary": "Large language models (LLMs), such as ChatGPT, are able to generate human-like, fluent responses for many downstream tasks, e.g., task-oriented dialog and question answering. However, applying LLMs to real-world, mission-critical applications remains challenging mainly due to their tendency to generate hallucinations and their inability to use external knowledge. This paper proposes a LLM-Augmenter system, which augments a black-box LLM with a set of plug-and-play modules. Our system makes the LLM generate responses grounded in external knowledge, e.g., stored in task-specific databases. It also iteratively revises LLM prompts to improve model responses using feedback generated by utility functions, e.g., the factuality score of a LLM-generated response. The effectiveness of LLM-Augmenter is empirically validated on two types of scenarios, task-oriented dialog and open-domain question answering. LLM-Augmenter significantly reduces ChatGPT's hallucinations without sacrificing the fluency and informativeness of its responses. We make the source code and models publicly available.", "main_contribution": {"headline": "LLM-AUGMENTER: Enhancing LLMs with External Knowledge and Automated Feedback", "description": "The paper introduces LLM-AUGMENTER, a system that augments Large Language Models (LLMs) with plug-and-play modules to improve their performance in real-world applications. The system enables LLMs to generate responses grounded in external knowledge, such as task-specific databases, addressing the models' inability to use external knowledge. Additionally, it iteratively revises LLM prompts using feedback generated by utility functions, such as the factuality score of an LLM-generated response. This approach significantly reduces the tendency of LLMs, like ChatGPT, to generate hallucinations without sacrificing the fluency and informativeness of their responses."}, "takeaways": {"headline": "LLM-AUGMENTER offers a practical approach to improve LLMs' real-world applicability", "description": "The LLM-AUGMENTER system provides a practical solution to enhance the performance of LLMs in real-world applications. By grounding responses in external knowledge and iteratively revising prompts based on feedback, it addresses key challenges in LLM deployment, such as hallucinations and the inability to use external knowledge. This approach can be particularly useful in mission-critical applications where accuracy and factuality are paramount. The plug-and-play nature of the system also allows for easy integration with existing LLMs.", "example": "For instance, an LLM can be augmented with LLM-AUGMENTER to improve its performance in a task-oriented dialog application. The system would use external knowledge to ground the LLM's responses and iteratively revise the prompts based on feedback to ensure the accuracy and factuality of the responses."}, "category": "FINE-TUNING", "novelty_analysis": "The LLM-AUGMENTER system represents a novel approach to improving the performance of LLMs in real-world applications. Its use of plug-and-play modules to ground responses in external knowledge and revise prompts based on feedback is a unique contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, detailing the workings of the LLM-AUGMENTER system and its application in two types of scenarios. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of LLMs. The practical implications of the LLM-AUGMENTER system and its potential to improve the performance of LLMs in real-world applications make it an interesting read.", "enjoyable_score": 3}