{"Published": "2023-03-23", "Title": "GPTs are GPTs: An Early Look at the Labor Market Impact Potential of Large Language Models", "Authors": "Tyna Eloundou, Sam Manning, Pamela Mishkin, Daniel Rock", "Summary": "We investigate the potential implications of large language models (LLMs), such as Generative Pre-trained Transformers (GPTs), on the U.S. labor market, focusing on the increased capabilities arising from LLM-powered software compared to LLMs on their own. Using a new rubric, we assess occupations based on their alignment with LLM capabilities, integrating both human expertise and GPT-4 classifications. Our findings reveal that around 80% of the U.S. workforce could have at least 10% of their work tasks affected by the introduction of LLMs, while approximately 19% of workers may see at least 50% of their tasks impacted. We do not make predictions about the development or adoption timeline of such LLMs. The projected effects span all wage levels, with higher-income jobs potentially facing greater exposure to LLM capabilities and LLM-powered software. Significantly, these impacts are not restricted to industries with higher recent productivity growth. Our analysis suggests that, with access to an LLM, about 15% of all worker tasks in the US could be completed significantly faster at the same level of quality. When incorporating software and tooling built on top of LLMs, this share increases to between 47 and 56% of all tasks. This finding implies that LLM-powered software will have a substantial effect on scaling the economic impacts of the underlying models. We conclude that LLMs such as GPTs exhibit traits of general-purpose technologies, indicating that they could have considerable economic, social, and policy implications.", "main_contribution": {"headline": "Assessment of LLMs' Impact on the U.S. Labor Market", "description": "This paper investigates the potential implications of Large Language Models (LLMs) on the U.S. labor market. The authors develop a new rubric to assess occupations based on their alignment with LLM capabilities, integrating both human expertise and GPT-4 classifications. The study reveals that LLMs could significantly affect a large portion of the U.S. workforce, with higher-income jobs potentially facing greater exposure. The paper also highlights the substantial effect of LLM-powered software on scaling the economic impacts of the underlying models, suggesting that LLMs exhibit traits of general-purpose technologies."}, "takeaways": {"headline": "LLMs Could Significantly Impact the U.S. Labor Market", "description": "The paper's findings suggest that LLMs and LLM-powered software could have a considerable impact on the U.S. labor market, affecting tasks across all wage levels. For LLM practitioners, this underscores the potential of these models to transform various industries and tasks, and the need to consider the broader socio-economic implications of their work. The paper also highlights the importance of developing tools and software that can effectively harness the capabilities of LLMs to maximize their potential benefits.", "example": "For instance, an LLM practitioner could use these findings to guide the development of LLM-powered software, focusing on tasks that are most likely to be impacted by LLMs. This could include tasks in higher-income jobs, which the paper suggests could face greater exposure to LLM capabilities."}, "category": "BEHAVIOR", "novelty_analysis": "The paper presents a novel investigation into the potential impact of LLMs on the U.S. labor market, providing a comprehensive assessment of how these models could affect various occupations and tasks. The use of a new rubric to assess occupations based on their alignment with LLM capabilities is a unique contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is not overly technical, focusing more on the potential socio-economic implications of LLMs rather than their technical aspects. It is accessible to a wide range of readers, including those without a deep technical background in LLMs.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and presents an interesting investigation into the potential impact of LLMs on the labor market. It provides valuable insights into the broader implications of these models, making it an engaging read for those interested in the socio-economic aspects of LLMs.", "enjoyable_score": 3}