{"Published": "2023-05-24", "Title": "Chameleon: Plug-and-Play Compositional Reasoning with Large Language Models", "Authors": "Pan Lu, Baolin Peng, Hao Cheng, Michel Galley, Kai-Wei Chang, Ying Nian Wu, Song-Chun Zhu, Jianfeng Gao", "Summary": "Large language models (LLMs) have achieved remarkable progress in solving various natural language processing tasks due to emergent reasoning abilities. However, LLMs have inherent limitations as they are incapable of accessing up-to-date information (stored on the Web or in task-specific knowledge bases), using external tools, and performing precise mathematical and logical reasoning. In this paper, we present Chameleon, an AI system that mitigates these limitations by augmenting LLMs with plug-and-play modules for compositional reasoning. Chameleon synthesizes programs by composing various tools (e.g., LLMs, off-the-shelf vision models, web search engines, Python functions, and heuristic-based modules) for accomplishing complex reasoning tasks. At the heart of Chameleon is an LLM-based planner that assembles a sequence of tools to execute to generate the final response. We showcase the effectiveness of Chameleon on two multi-modal knowledge-intensive reasoning tasks: ScienceQA and TabMWP. Chameleon, powered by GPT-4, achieves an 86.54% overall accuracy on ScienceQA, improving the best published few-shot result by 11.37%. On TabMWP, GPT-4-powered Chameleon improves the accuracy by 17.0%, lifting the state of the art to 98.78%. Our analysis also shows that the GPT-4-powered planner exhibits more consistent and rational tool selection via inferring potential constraints from instructions, compared to a ChatGPT-powered planner.", "main_contribution": {"headline": "Chameleon: A system augmenting LLMs with plug-and-play modules for compositional reasoning", "description": "The paper introduces Chameleon, an AI system designed to overcome the limitations of Large Language Models (LLMs) by augmenting them with plug-and-play modules for compositional reasoning. Chameleon synthesizes programs by composing various tools such as LLMs, off-the-shelf vision models, web search engines, Python functions, and heuristic-based modules to accomplish complex reasoning tasks. The core of Chameleon is an LLM-based planner that assembles a sequence of tools to execute to generate the final response. The system demonstrates significant improvements in accuracy on two multi-modal knowledge-intensive reasoning tasks: ScienceQA and TabMWP."}, "takeaways": {"headline": "Chameleon offers a new approach to enhance LLMs' reasoning capabilities", "description": "Chameleon presents a novel way to enhance the reasoning capabilities of LLMs by integrating them with various tools. This approach can be used to build more robust and versatile AI systems capable of handling complex reasoning tasks. The plug-and-play nature of the modules allows for flexibility and adaptability in different application scenarios. The significant improvements in accuracy on tasks like ScienceQA and TabMWP demonstrate the potential of this approach in practical applications.", "example": "For instance, an LLM practitioner could use Chameleon to build a multi-modal question answering system. The system could use an LLM for text understanding, a vision model for image analysis, a web search engine for information retrieval, and Python functions for data processing. The LLM-based planner would then assemble these tools in a sequence to generate the final answer."}, "category": "ARCHITECTURES", "novelty_analysis": "Chameleon introduces a novel approach to enhance the reasoning capabilities of LLMs by integrating them with various tools. This represents a significant advancement in the field, offering a new way to build more robust and versatile AI systems.", "novelty_score": 3, "technical_analysis": "The paper is highly technical, detailing the design and implementation of Chameleon, an AI system that integrates LLMs with various tools. It requires a solid understanding of LLMs and compositional reasoning.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field. However, the high level of technical detail may make it a challenging read for those without a strong background in the field.", "enjoyable_score": 2}