{"Published": "2023-06-07", "Title": "ChatGPT is fun, but it is not funny! Humor is still challenging Large Language Models", "Authors": "Sophie Jentzsch, Kristian Kersting", "Summary": "Humor is a central aspect of human communication that has not been solved for artificial agents so far. Large language models (LLMs) are increasingly able to capture implicit and contextual information. Especially, OpenAI's ChatGPT recently gained immense public attention. The GPT3-based model almost seems to communicate on a human level and can even tell jokes. Humor is an essential component of human communication. But is ChatGPT really funny? We put ChatGPT's sense of humor to the test. In a series of exploratory experiments around jokes, i.e., generation, explanation, and detection, we seek to understand ChatGPT's capability to grasp and reproduce human humor. Since the model itself is not accessible, we applied prompt-based experiments. Our empirical evidence indicates that jokes are not hard-coded but mostly also not newly generated by the model. Over 90% of 1008 generated jokes were the same 25 Jokes. The system accurately explains valid jokes but also comes up with fictional explanations for invalid jokes. Joke-typical characteristics can mislead ChatGPT in the classification of jokes. ChatGPT has not solved computational humor yet but it can be a big leap toward \"funny\" machines.", "main_contribution": {"headline": "Exploring the Humor Capabilities of Large Language Models", "description": "The paper investigates the humor capabilities of OpenAI's ChatGPT, a large language model (LLM), through a series of exploratory experiments. The authors focus on three aspects: joke generation, joke explanation, and joke detection. The study reveals that while ChatGPT can generate and explain jokes, it mostly reproduces existing jokes rather than creating new ones. Over 90% of the generated jokes were repetitions of the same 25 jokes. The model can accurately explain valid jokes but also generates fictional explanations for invalid ones. The study concludes that while ChatGPT has not fully mastered computational humor, it represents a significant step towards creating 'funny' machines."}, "takeaways": {"headline": "ChatGPT's Humor Capabilities Show Promise but Need Improvement", "description": "The paper's findings suggest that while ChatGPT can generate and explain jokes, its humor capabilities are largely based on reproducing existing jokes rather than creating new ones. This insight can be useful for developers and researchers working on improving the humor capabilities of LLMs. For instance, they could focus on enhancing the model's ability to generate original jokes. Additionally, the study's methodology, which involves prompt-based experiments, can serve as a blueprint for future research on understanding and improving the capabilities of LLMs.", "example": "For instance, a developer could use a similar approach to test an LLM's ability to generate original jokes. They could prompt the model to generate a large number of jokes and then analyze the output to determine how many of the jokes are original and how many are reproductions of existing jokes."}, "category": "BEHAVIOR", "novelty_analysis": "The paper presents a unique exploration of the humor capabilities of LLMs, specifically focusing on joke generation, explanation, and detection. While the use of LLMs is not new, the specific focus on humor and the methodology used to test the model's capabilities provide a novel contribution to the field.", "novelty_score": 2, "technical_analysis": "The paper is somewhat technical, providing a detailed explanation of the methodology used to test ChatGPT's humor capabilities. However, it does not delve into complex mathematical theories or algorithms, making it accessible to a wider audience with a basic understanding of LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting exploration of the humor capabilities of LLMs. The use of examples and clear explanations of the methodology and findings make it an engaging read for those interested in the capabilities and limitations of LLMs.", "enjoyable_score": 2}