{"Published": "2023-06-13", "Title": "Beyond Black Box AI-Generated Plagiarism Detection: From Sentence to Document Level", "Authors": "Mujahid Ali Quidwai, Chunhui Li, Parijat Dube", "Summary": "The increasing reliance on large language models (LLMs) in academic writing has led to a rise in plagiarism. Existing AI-generated text classifiers have limited accuracy and often produce false positives. We propose a novel approach using natural language processing (NLP) techniques, offering quantifiable metrics at both sentence and document levels for easier interpretation by human evaluators. Our method employs a multi-faceted approach, generating multiple paraphrased versions of a given question and inputting them into the LLM to generate answers. By using a contrastive loss function based on cosine similarity, we match generated sentences with those from the student's response. Our approach achieves up to 94% accuracy in classifying human and AI text, providing a robust and adaptable solution for plagiarism detection in academic settings. This method improves with LLM advancements, reducing the need for new model training or reconfiguration, and offers a more transparent way of evaluating and detecting AI-generated text.", "main_contribution": "The paper introduces a novel method for detecting plagiarism in academic writing caused by the use of large language models (LLMs). The method uses natural language processing (NLP) techniques to generate multiple paraphrased versions of a given question, which are then inputted into the LLM to generate answers. These generated sentences are then matched with those from the student's response using a contrastive loss function based on cosine similarity.", "takeaways": "The proposed method offers a robust and adaptable solution for plagiarism detection in academic settings, achieving up to 94% accuracy in classifying human and AI text. It provides quantifiable metrics at both sentence and document levels, making it easier for human evaluators to interpret. Furthermore, the method improves with advancements in LLMs, reducing the need for new model training or reconfiguration, and offers a more transparent way of evaluating and detecting AI-generated text.", "novelty_analysis": "The paper presents a unique approach to plagiarism detection, focusing on the challenges posed by the use of LLMs in academic writing. The use of NLP techniques to generate paraphrased versions of a given question, and the application of a contrastive loss function based on cosine similarity for matching sentences, are novel contributions to the field.", "novelty_score": 3, "category": "BEHAVIOR", "technical_analysis": "The paper is somewhat technical, discussing the use of NLP techniques and a contrastive loss function based on cosine similarity. However, the concepts are explained in a clear and comprehensive manner, making it accessible to those with a computer science background.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field of plagiarism detection. The clear explanation of the proposed method and its potential implications make it an enjoyable read.", "enjoyable_score": 3}