{"Published": "2023-08-01", "Title": "Skills-in-Context Prompting: Unlocking Compositionality in Large Language Models", "Authors": "Jiaao Chen, Xiaoman Pan, Dian Yu, Kaiqiang Song, Xiaoyang Wang, Dong Yu, Jianshu Chen", "Summary": "We consider the problem of eliciting compositional generalization capabilities in large language models (LLMs) with a novel type of prompting strategy. Compositional generalization empowers the LLMs to solve problems that are harder than the ones they have seen (i.e., easy-to-hard generalization), which is a critical reasoning capability of human-like intelligence. However, even the current state-of-the-art LLMs still struggle with this form of reasoning. To bridge this gap, we propose skills-in-context (SKiC) prompting, which instructs LLMs how to compose basic skills to resolve more complex problems. We find that it is crucial to demonstrate both the skills and the compositional examples within the same prompting context. With as few as two examplars, our SKiC prompting initiates strong synergies between skills and their composition capabilities. Notably, it empowers LLMs to solve unseen problems that require innovative skill compositions, achieving near-perfect generalization on a broad range of challenging compositionality tasks. Intriguingly, SKiC prompting unlocks the latent potential of LLMs, enabling them to leverage pre-existing internal skills acquired during earlier pretraining and alignment stages, even when these skills are not explicitly presented in the prompting context. This results in the capability of LLMs to solve unseen complex problems by activating and composing these internal competencies.", "main_contribution": {"headline": "Skills-in-Context (SKiC) prompting enhances compositional generalization in LLMs", "description": "The paper introduces a novel prompting strategy, Skills-in-Context (SKiC), aimed at improving the compositional generalization capabilities of Large Language Models (LLMs). Compositional generalization refers to the ability of LLMs to solve complex problems by composing basic skills, a critical reasoning capability of human-like intelligence. SKiC prompting instructs LLMs on how to compose these basic skills to solve more complex problems. The authors demonstrate that it is crucial to present both the skills and the compositional examples within the same prompting context. This approach enables LLMs to solve unseen problems that require innovative skill compositions, achieving near-perfect generalization on a broad range of challenging compositionality tasks."}, "takeaways": {"headline": "SKiC prompting unlocks latent potential of LLMs, enhancing their problem-solving capabilities", "description": "The SKiC prompting strategy can be used to improve the problem-solving capabilities of LLMs, particularly in tasks that require compositional generalization. By demonstrating both the skills and the compositional examples within the same prompting context, LLMs can be trained to solve complex problems that they have not seen before. This approach can be particularly useful in applications that require the model to reason and solve complex problems, such as in natural language understanding, question answering, and other advanced NLP tasks.", "example": "For instance, an LLM trained with SKiC prompting could be used to solve complex natural language understanding tasks. Given a complex sentence, the model could be prompted with a series of simpler sentences that demonstrate the skills required to understand the complex sentence. The model could then use these skills to understand and respond to the complex sentence."}, "category": "PROMPTING", "novelty_analysis": "The introduction of the SKiC prompting strategy represents a significant advancement in the field of LLM prompting. While previous methods have attempted to improve the compositional generalization capabilities of LLMs, the SKiC prompting strategy is unique in its approach of demonstrating both the skills and the compositional examples within the same prompting context.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it introduces a new prompting strategy and discusses its implementation in detail. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and prompting strategies.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents an interesting and novel approach to improving the compositional generalization capabilities of LLMs. The practical implications of the SKiC prompting strategy are clearly explained, making the paper an enjoyable and informative read.", "enjoyable_score": 3}