{"Published": "2023-06-05", "Title": "Leveraging Large Language Models for Topic Classification in the Domain of Public Affairs", "Authors": "Alejandro Peña, Aythami Morales, Julian Fierrez, Ignacio Serna, Javier Ortega-Garcia, Iñigo Puente, Jorge Cordova, Gonzalo Cordova", "Summary": "The analysis of public affairs documents is crucial for citizens as it promotes transparency, accountability, and informed decision-making. It allows citizens to understand government policies, participate in public discourse, and hold representatives accountable. This is crucial, and sometimes a matter of life or death, for companies whose operation depend on certain regulations. Large Language Models (LLMs) have the potential to greatly enhance the analysis of public affairs documents by effectively processing and understanding the complex language used in such documents. In this work, we analyze the performance of LLMs in classifying public affairs documents. As a natural multi-label task, the classification of these documents presents important challenges. In this work, we use a regex-powered tool to collect a database of public affairs documents with more than 33K samples and 22.5M tokens. Our experiments assess the performance of 4 different Spanish LLMs to classify up to 30 different topics in the data in different configurations. The results shows that LLMs can be of great use to process domain-specific documents, such as those in the domain of public affairs.", "main_contribution": {"headline": "Effective use of LLMs for topic classification in public affairs documents", "description": "The paper presents a comprehensive study on the use of Large Language Models (LLMs) for topic classification in public affairs documents. The authors have collected a large database of public affairs documents using a regex-powered tool, and have used this database to assess the performance of four different Spanish LLMs. The study shows that LLMs can effectively process and understand the complex language used in public affairs documents, and can classify these documents into up to 30 different topics. This work demonstrates the potential of LLMs in processing domain-specific documents, particularly in the field of public affairs."}, "takeaways": {"headline": "LLMs can enhance transparency and accountability in public affairs", "description": "The use of LLMs in classifying public affairs documents can greatly enhance transparency and accountability in public affairs. By effectively processing and understanding the complex language used in these documents, LLMs can help citizens understand government policies, participate in public discourse, and hold representatives accountable. For practitioners, this means that LLMs can be trained to classify documents into specific topics, which can be useful in various applications such as policy analysis, public opinion tracking, and regulatory compliance.", "example": "For instance, an LLM can be trained to classify public affairs documents into topics such as 'healthcare', 'education', 'environment', etc. When a new document is input, the LLM can quickly and accurately classify it into one or more of these topics, making it easier for citizens, companies, and government agencies to find and understand relevant information."}, "category": "USE CASES", "novelty_analysis": "While the use of LLMs for document classification is not new, the application of these models to the domain of public affairs represents a novel contribution. The collection of a large database of public affairs documents and the assessment of four different Spanish LLMs also add to the novelty of this work.", "novelty_score": 2, "technical_analysis": "The paper is somewhat technical, as it involves the use of LLMs for document classification, a task that requires a good understanding of natural language processing. However, the concepts and methods used in the study are well-explained and should be accessible to readers with a background in AI and machine learning.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents an interesting application of LLMs. The use of real-world examples and clear explanations of the methods used make it an enjoyable read for those interested in the application of AI in public affairs.", "enjoyable_score": 2}