{"Published": "2021-09-16", "Title": "Urdu text in natural scene images: a new dataset and preliminary text detection", "Authors": "Hazrat Ali, Khalid Iqbal, Ghulam Mujtaba, Ahmad Fayyaz, Mohammad Farhad Bulbul, Fazal Wahab Karam, Ali Zahir", "Summary": "Text detection in natural scene images for content analysis is an interesting task. The research community has seen some great developments for English/Mandarin text detection. However, Urdu text extraction in natural scene images is a task not well addressed. In this work, firstly, a new dataset is introduced for Urdu text in natural scene images. The dataset comprises of 500 standalone images acquired from real scenes. Secondly, the channel enhanced Maximally Stable Extremal Region (MSER) method is applied to extract Urdu text regions as candidates in an image. Two-stage filtering mechanism is applied to eliminate non-candidate regions. In the first stage, text and noise are classified based on their geometric properties. In the second stage, a support vector machine classifier is trained to discard non-text candidate regions. After this, text candidate regions are linked using centroid-based vertical and horizontal distances. Text lines are further analyzed by a different classifier based on HOG features to remove non-text regions. Extensive experimentation is performed on the locally developed dataset to evaluate the performance. The experimental results show good performance on test set images. The dataset will be made available for research use. To the best of our knowledge, the work is the first of its kind for the Urdu language and would provide a good dataset for free research use and serve as a baseline performance on the task of Urdu text extraction.", "main_contribution": {"headline": "New Dataset and Method for Urdu Text Detection in Natural Scene Images", "description": "The paper introduces a new dataset for Urdu text in natural scene images, comprising 500 standalone images from real scenes. This dataset is a significant contribution as Urdu text extraction from natural scene images has been underexplored due to the lack of suitable datasets. The authors also propose a method for Urdu text detection using the Maximally Stable Extremal Region (MSER) technique. This method involves a two-stage filtering mechanism to eliminate non-candidate regions and a support vector machine classifier to discard non-text candidate regions. The text candidate regions are then linked using centroid-based vertical and horizontal distances, and a different classifier based on Histogram of Oriented Gradients (HoG) features is used to remove non-text regions."}, "takeaways": {"headline": "Urdu Text Detection in Natural Scene Images Opens New Avenues for LLMs", "description": "The new dataset and method for Urdu text detection in natural scene images can be used to improve the performance of LLMs in tasks involving Urdu text. The proposed method can be used as a pre-processing step to extract Urdu text from images, which can then be fed into an LLM for various tasks such as translation, sentiment analysis, or information extraction. The dataset can also be used to train and test models specifically designed for Urdu text detection in images.", "example": "For instance, an LLM can be used to translate the extracted Urdu text into English or any other language. The code might look something like this: 1. Use the proposed method to extract Urdu text from an image. 2. Feed the extracted text into an LLM trained for translation. 3. The LLM outputs the translated text."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel contribution in the form of a new dataset for Urdu text in natural scene images and a method for Urdu text detection. This is a significant advancement in the field as Urdu text extraction from natural scene images has been underexplored due to the lack of suitable datasets.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it delves into the details of the proposed method for Urdu text detection, including the use of the MSER technique, a two-stage filtering mechanism, and classifiers based on geometric properties and HoG features. However, it does not involve complex mathematical theories or algorithms.", "technical_score": 2, "enjoyable_analysis": "The paper is well-organized and presents a novel and intriguing contribution. However, the technical details of the proposed method might be challenging for readers without a background in image processing or machine learning.", "enjoyable_score": 2}