{"Published": "2022-09-05", "Title": "Selective Annotation Makes Language Models Better Few-Shot Learners", "Authors": "Hongjin Su, Jungo Kasai, Chen Henry Wu, Weijia Shi, Tianlu Wang, Jiayi Xin, Rui Zhang, Mari Ostendorf, Luke Zettlemoyer, Noah A. Smith, Tao Yu", "Summary": "Many recent approaches to natural language tasks are built on the remarkable abilities of large language models. Large language models can perform in-context learning, where they learn a new task from a few task demonstrations, without any parameter updates. This work examines the implications of in-context learning for the creation of datasets for new natural language tasks. Departing from recent in-context learning methods, we formulate an annotation-efficient, two-step framework: selective annotation that chooses a pool of examples to annotate from unlabeled data in advance, followed by prompt retrieval that retrieves task examples from the annotated pool at test time. Based on this framework, we propose an unsupervised, graph-based selective annotation method, voke-k, to select diverse, representative examples to annotate. Extensive experiments on 10 datasets (covering classification, commonsense reasoning, dialogue, and text/code generation) demonstrate that our selective annotation method improves the task performance by a large margin. On average, vote-k achieves a 12.9%/11.4% relative gain under an annotation budget of 18/100, as compared to randomly selecting examples to annotate. Compared to state-of-the-art supervised finetuning approaches, it yields similar performance with 10-100x less annotation cost across 10 tasks. We further analyze the effectiveness of our framework in various scenarios: language models with varying sizes, alternative selective annotation methods, and cases where there is a test data domain shift. We hope that our studies will serve as a basis for data annotations as large language models are increasingly applied to new tasks. Our code is available at https://github.com/HKUNLP/icl-selective-annotation.", "main_contribution": {"headline": "Selective Annotation Framework Improves In-Context Learning in Large Language Models", "description": "The paper introduces a two-step framework for in-context learning in large language models (LLMs), focusing on efficient data annotation. The first step, selective annotation, involves choosing a pool of examples to annotate from unlabeled data in advance. The second step, prompt retrieval, retrieves task examples from the annotated pool at test time. The authors propose an unsupervised, graph-based selective annotation method, vote-k, which selects diverse, representative examples to annotate. This method significantly improves task performance and reduces annotation costs compared to traditional supervised fine-tuning approaches."}, "takeaways": {"headline": "Selective Annotation Framework Enhances Efficiency and Performance of LLMs", "description": "The selective annotation framework can be a valuable tool for LLM practitioners, as it improves task performance while reducing annotation costs. The vote-k method, in particular, can be used to select diverse and representative examples from unlabeled data, enhancing the model's ability to learn from a few task demonstrations. This approach can be particularly useful when dealing with large datasets and limited annotation budgets. The framework's effectiveness across different language model sizes and in cases of test data domain shift further underscores its versatility and robustness.", "example": "For instance, given a large unlabeled dataset for a new task, an LLM practitioner can use the vote-k method to select a small, representative subset of examples to annotate. These annotated examples can then be used at test time to provide in-context examples, improving the model's performance on the task."}, "category": "TRAINING", "novelty_analysis": "The paper presents a novel approach to in-context learning in LLMs, focusing on efficient data annotation. The introduction of the two-step framework and the vote-k method represents a significant advancement in the field, offering a new way to improve task performance and reduce annotation costs.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it introduces a new framework and method for in-context learning in LLMs. It requires a basic understanding of LLMs and data annotation, but does not delve into complex mathematical theories or algorithms.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel approach to a significant challenge in the field of LLMs. The clear explanation of the proposed framework and method, along with the extensive experiments demonstrating their effectiveness, make the paper an engaging read.", "enjoyable_score": 2}