{"Published": "2023-04-11", "Title": "Decomposed Prompting: A Modular Approach for Solving Complex Tasks", "Authors": "Tushar Khot, Harsh Trivedi, Matthew Finlayson, Yao Fu, Kyle Richardson, Peter Clark, Ashish Sabharwal", "Summary": "Few-shot prompting is a surprisingly powerful way to use Large Language Models (LLMs) to solve various tasks. However, this approach struggles as the task complexity increases or when the individual reasoning steps of the task themselves are hard to learn, especially when embedded in more complex tasks. To address this, we propose Decomposed Prompting, a new approach to solve complex tasks by decomposing them (via prompting) into simpler sub-tasks that can be delegated to a library of prompting-based LLMs dedicated to these sub-tasks. This modular structure allows each prompt to be optimized for its specific sub-task, further decomposed if necessary, and even easily replaced with more effective prompts, trained models, or symbolic functions if desired. We show that the flexibility and modularity of Decomposed Prompting allows it to outperform prior work on few-shot prompting using GPT3. On symbolic reasoning tasks, we can further decompose sub-tasks that are hard for LLMs into even simpler solvable sub-tasks. When the complexity comes from the input length, we can recursively decompose the task into the same task but with smaller inputs. We also evaluate our approach on textual multi-step reasoning tasks: on long-context multi-hop QA task, we can more effectively teach the sub-tasks via our separate sub-tasks prompts; and on open-domain multi-hop QA, we can incorporate a symbolic information retrieval within our decomposition framework, leading to improved performance on both tasks. Datasets, Code and Prompts available at https://github.com/allenai/DecomP.", "main_contribution": {"headline": "Decomposed Prompting: A modular approach to solve complex tasks with LLMs", "description": "The paper introduces Decomposed Prompting (DECOMP), a novel approach to solve complex tasks using Large Language Models (LLMs). DECOMP decomposes complex tasks into simpler sub-tasks and delegates these to sub-task specific LLMs. This modular structure allows each prompt to be optimized for its specific sub-task, further decomposed if necessary, and even easily replaced with more effective prompts, trained models, or symbolic functions if desired. The authors demonstrate that DECOMP outperforms prior work on few-shot prompting using GPT-3, especially on symbolic reasoning tasks and textual multi-step reasoning tasks."}, "takeaways": {"headline": "Decomposed Prompting enhances LLMs' ability to handle complex tasks", "description": "Decomposed Prompting provides a new way to leverage LLMs for complex tasks by breaking them down into simpler sub-tasks. This approach not only improves the performance of LLMs on complex tasks but also provides flexibility in optimizing and replacing prompts for specific sub-tasks. Practitioners can use this approach to enhance the capabilities of LLMs in various applications, especially those involving complex reasoning or multi-step tasks.", "example": "For instance, a complex task like 'summarize and translate a long document' can be decomposed into sub-tasks like 'summarize the document' and 'translate the summary'. Each sub-task can be handled by a specific LLM optimized for that task, improving the overall performance."}, "category": "PROMPTING", "novelty_analysis": "Decomposed Prompting is a novel approach that extends the capabilities of LLMs to handle complex tasks by decomposing them into simpler sub-tasks. This modular approach is a significant advancement in the field of prompting techniques for LLMs.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it introduces a new approach to prompting and provides a detailed explanation of how it works. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and prompting techniques.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of LLMs. The clear explanation of the Decomposed Prompting approach and its potential applications make it an enjoyable read for those interested in LLMs and prompting techniques.", "enjoyable_score": 3}