{"Published": "2022-10-04", "Title": "Robot Task Planning and Situation Handling in Open Worlds", "Authors": "Yan Ding, Xiaohan Zhang, Saeid Amiri, Nieqing Cao, Hao Yang, Chad Esselink, Shiqi Zhang", "Summary": "Automated task planning algorithms have been developed to help robots complete complex tasks that require multiple actions. Most of those algorithms have been developed for \"closed worlds\" assuming complete world knowledge is provided. However, the real world is generally open, and the robots frequently encounter unforeseen situations that can potentially break the planner's completeness. This paper introduces a novel algorithm (COWP) for open-world task planning and situation handling that dynamically augments the robot's action knowledge with task-oriented common sense. In particular, common sense is extracted from Large Language Models based on the current task at hand and robot skills. For systematic evaluations, we collected a dataset that includes 561 execution-time situations in a dining domain, where each situation corresponds to a state instance of a robot being potentially unable to complete a task using a solution that normally works. Experimental results show that our approach significantly outperforms competitive baselines from the literature in the success rate of service tasks. Additionally, we have demonstrated COWP using a mobile manipulator. Supplementary materials are available at: https://cowplanning.github.io/", "main_contribution": {"headline": "COWP: A novel algorithm for open-world task planning and situation handling in robotics", "description": "The paper introduces a new algorithm, COWP (Commonsense for Open-World Planning), designed to enhance the ability of robots to handle unforeseen situations in open-world environments. Unlike traditional task planning algorithms that operate under the 'closed world' assumption, COWP dynamically augments the robot's action knowledge with task-oriented common sense. This common sense is extracted from Large Language Models (LLMs) based on the current task and the robot's skills. The authors demonstrate the effectiveness of COWP in a dining domain, where it outperforms competitive baselines in the success rate of service tasks."}, "takeaways": {"headline": "COWP offers a new approach to handle unforeseen situations in robotics using LLMs", "description": "The COWP algorithm presents a novel way of using LLMs to enhance the adaptability of robots in open-world environments. By extracting task-oriented common sense from LLMs, robots can better handle unforeseen situations, improving their performance in complex tasks. This approach could be particularly useful in domains where robots need to interact with dynamic and unpredictable environments, such as service robots in homes or public spaces.", "example": "For instance, a service robot in a restaurant could use COWP to handle unexpected situations. If the robot's task is to serve a glass of water and it finds the glass is dirty, it could use common sense extracted from an LLM to decide to clean the glass before serving water."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel approach to open-world task planning in robotics by leveraging the common sense knowledge extracted from LLMs. This represents a significant advancement in the field, as it allows robots to handle unforeseen situations more effectively.", "novelty_score": 3, "technical_analysis": "The paper is quite technical, as it introduces a new algorithm and demonstrates its application in a specific domain. It requires a good understanding of task planning algorithms, LLMs, and robotics to fully comprehend the content.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents an interesting and novel approach to a complex problem in robotics. However, the technical nature of the content might make it less enjoyable for readers without a background in the field.", "enjoyable_score": 2}