{"Published": "2023-07-27", "Title": "Large Language Models Struggle to Learn Long-Tail Knowledge", "Authors": "Nikhil Kandpal, Haikang Deng, Adam Roberts, Eric Wallace, Colin Raffel", "Summary": "The Internet contains a wealth of knowledge -- from the birthdays of historical figures to tutorials on how to code -- all of which may be learned by language models. However, while certain pieces of information are ubiquitous on the web, others appear extremely rarely. In this paper, we study the relationship between the knowledge memorized by large language models and the information in pre-training datasets scraped from the web. In particular, we show that a language model's ability to answer a fact-based question relates to how many documents associated with that question were seen during pre-training. We identify these relevant documents by entity linking pre-training datasets and counting documents that contain the same entities as a given question-answer pair. Our results demonstrate strong correlational and causal relationships between accuracy and relevant document count for numerous question answering datasets (e.g., TriviaQA), pre-training corpora (e.g., ROOTS), and model sizes (e.g., 176B parameters). Moreover, while larger models are better at learning long-tail knowledge, we estimate that today's models must be scaled by many orders of magnitude to reach competitive QA performance on questions with little support in the pre-training data. Finally, we show that retrieval-augmentation can reduce the dependence on relevant pre-training information, presenting a promising approach for capturing the long-tail.", "main_contribution": {"headline": "Large Language Models' ability to answer questions is tied to the number of relevant documents seen during pre-training", "description": "The paper investigates the relationship between the knowledge learned by Large Language Models (LLMs) and the information in their pre-training datasets. The authors demonstrate that an LLM's ability to answer a fact-based question is related to the number of documents associated with that question seen during pre-training. They identify these relevant documents by entity linking pre-training datasets and counting documents that contain the same entities as a given question-answer pair. The results show strong correlational and causal relationships between accuracy and relevant document count for various question answering datasets, pre-training corpora, and model sizes."}, "takeaways": {"headline": "LLMs' performance on fact-based questions can be improved by increasing the number of relevant documents during pre-training", "description": "The findings of this paper suggest that the performance of LLMs on fact-based questions can be improved by increasing the number of relevant documents during pre-training. This can be achieved by using entity linking to identify and count documents that contain the same entities as a given question-answer pair. Additionally, the paper shows that retrieval-augmentation can reduce the dependence on relevant pre-training information, presenting a promising approach for capturing the long-tail of information.", "example": "For instance, if an LLM is struggling to answer questions about a specific historical event, one could improve its performance by increasing the number of documents about that event in the pre-training data. This could be achieved by using entity linking to identify and count documents that mention the same entities as the questions about the event."}, "category": "TRAINING", "novelty_analysis": "The paper provides a novel insight into the relationship between the knowledge learned by LLMs and the information in their pre-training datasets. The finding that an LLM's ability to answer a fact-based question is related to the number of documents associated with that question seen during pre-training is a significant contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it delves into the details of how LLMs learn from their pre-training datasets and how this learning process can be improved. However, it does not require advanced mathematical knowledge and can be understood by someone with a background in machine learning.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents an interesting investigation into the learning process of LLMs. The findings are significant and have practical implications for the training of LLMs, making the paper an enjoyable read for those interested in the field.", "enjoyable_score": 3}