{"Published": "2023-02-03", "Title": "Describe, Explain, Plan and Select: Interactive Planning with Large Language Models Enables Open-World Multi-Task Agents", "Authors": "Zihao Wang, Shaofei Cai, Anji Liu, Xiaojian Ma, Yitao Liang", "Summary": "In this paper, we study the problem of planning in Minecraft, a popular, democratized yet challenging open-ended environment for developing multi-task embodied agents. We've found two primary challenges of empowering such agents with planning: 1) planning in an open-ended world like Minecraft requires precise and multi-step reasoning due to the long-term nature of the tasks, and 2) as vanilla planners do not consider the proximity to the current agent when ordering parallel sub-goals within a complicated plan, the resulting plan could be inefficient. To this end, we propose \"Describe, Explain, Plan and Select\" (DEPS), an interactive planning approach based on Large Language Models (LLMs). Our approach helps with better error correction from the feedback during the long-haul planning, while also bringing the sense of proximity via goal Selector, a learnable module that ranks parallel sub-goals based on the estimated steps of completion and improves the original plan accordingly. Our experiments mark the milestone of the first multi-task agent that can robustly accomplish 70+ Minecraft tasks and nearly doubles the overall performances. Finally, the ablation and exploratory studies detail how our design beats the counterparts and provide a promising update on the $\\texttt{ObtainDiamond}$ grand challenge with our approach. The code is released at https://github.com/CraftJarvis/MC-Planner.", "main_contribution": {"headline": "DEPS: An Interactive Planning Approach for Multi-Task Agents in Open-World Environments", "description": "The paper introduces 'Describe, Explain, Plan and Select' (DEPS), an interactive planning approach based on Large Language Models (LLMs) for multi-task agents in open-world environments like Minecraft. DEPS addresses two main challenges: the need for precise, multi-step reasoning for long-term tasks, and the inefficiency of vanilla planners that do not consider the agent's proximity when ordering sub-goals. DEPS includes a goal Selector, a learnable module that ranks parallel sub-goals based on estimated steps of completion, improving the original plan. The approach significantly enhances the performance of multi-task agents, enabling them to robustly accomplish 70+ Minecraft tasks."}, "takeaways": {"headline": "DEPS Enhances LLM-Based Planning for Multi-Task Agents in Open-World Environments", "description": "The DEPS approach presents a promising strategy for improving the planning capabilities of multi-task agents in open-world environments. By incorporating a goal Selector that ranks parallel sub-goals, DEPS brings a sense of proximity to the planning process, enhancing efficiency. This approach could be applied to other open-world environments beyond Minecraft, potentially improving the performance of multi-task agents in various applications.", "example": "For instance, in a virtual assistant application, DEPS could be used to prioritize tasks based on their urgency or the estimated time for completion. The assistant could then execute tasks in an efficient order, improving overall performance."}, "category": "USE CASES", "novelty_analysis": "The DEPS approach introduces a novel way of enhancing the planning capabilities of multi-task agents in open-world environments. The inclusion of a goal Selector that ranks parallel sub-goals based on estimated steps of completion is a unique feature that sets DEPS apart from other planning approaches.", "novelty_score": 3, "technical_analysis": "The paper is highly technical, delving into the intricacies of the DEPS approach and its implementation. It requires a solid understanding of Large Language Models and planning algorithms to fully comprehend the content.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and presents a novel approach to a challenging problem. However, the high level of technical detail might make it a challenging read for those without a strong background in the field.", "enjoyable_score": 2}