{"Published": "2023-03-14", "Title": "Query2doc: Query Expansion with Large Language Models", "Authors": "Liang Wang, Nan Yang, Furu Wei", "Summary": "This paper introduces a simple yet effective query expansion approach, denoted as query2doc, to improve both sparse and dense retrieval systems. The proposed method first generates pseudo-documents by few-shot prompting large language models (LLMs), and then expands the query with generated pseudo-documents. LLMs are trained on web-scale text corpora and are adept at knowledge memorization. The pseudo-documents from LLMs often contain highly relevant information that can aid in query disambiguation and guide the retrievers. Experimental results demonstrate that query2doc boosts the performance of BM25 by 3% to 15% on ad-hoc IR datasets, such as MS-MARCO and TREC DL, without any model fine-tuning. Furthermore, our method also benefits state-of-the-art dense retrievers in terms of both in-domain and out-of-domain results.", "main_contribution": {"headline": "Query2doc: A novel query expansion approach using Large Language Models", "description": "The paper introduces a new method, query2doc, for query expansion in information retrieval systems. This method leverages Large Language Models (LLMs) to generate pseudo-documents based on few-shot prompts. These pseudo-documents, containing highly relevant information, are then used to expand the original query. The novelty lies in the use of LLMs for query expansion, which is shown to improve both sparse and dense retrieval systems. The method is simple to implement and does not require any changes in training pipelines or model architectures."}, "takeaways": {"headline": "Query2doc offers a simple and effective way to improve retrieval systems", "description": "The query2doc method can be used to enhance the performance of both sparse and dense retrieval systems. By generating pseudo-documents using LLMs and expanding the original query with these documents, the method aids in query disambiguation and guides the retrievers. This approach can be easily integrated into existing systems without any changes in training pipelines or model architectures, making it a practical tool for LLM practitioners.", "example": "For instance, given a short and ambiguous query like 'apple', an LLM can generate a pseudo-document like 'Apple Inc., the multinational technology company known for products like the iPhone and the Mac.' This expanded query can then be used to retrieve more relevant documents."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel use of Large Language Models for query expansion in information retrieval systems. The proposed method, query2doc, is a new approach that leverages the knowledge memorization ability of LLMs to generate pseudo-documents for query expansion.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the details of the proposed query2doc method and its implementation. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of information retrieval and Large Language Models.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting approach to query expansion. The clear explanation of the proposed method and the presentation of experimental results make it an engaging read for those interested in information retrieval and Large Language Models.", "enjoyable_score": 3}