{"Published": "2023-03-25", "Title": "GPT is becoming a Turing machine: Here are some ways to program it", "Authors": "Ana Jojic, Zhen Wang, Nebojsa Jojic", "Summary": "We demonstrate that, through appropriate prompting, GPT-3 family of models can be triggered to perform iterative behaviours necessary to execute (rather than just write or recall) programs that involve loops, including several popular algorithms found in computer science curricula or software developer interviews. We trigger execution and description of Iterations by Regimenting Self-Attention (IRSA) in one (or a combination) of three ways: 1) Using strong repetitive structure in an example of an execution path of a target program for one particular input, 2) Prompting with fragments of execution paths, and 3) Explicitly forbidding (skipping) self-attention to parts of the generated text. On a dynamic program execution, IRSA leads to larger accuracy gains than replacing the model with the much more powerful GPT-4. IRSA has promising applications in education, as the prompts and responses resemble student assignments in data structures and algorithms classes. Our findings hold implications for evaluating LLMs, which typically target the in-context learning: We show that prompts that may not even cover one full task example can trigger algorithmic behaviour, allowing solving problems previously thought of as hard for LLMs, such as logical puzzles. Consequently, prompt design plays an even more critical role in LLM performance than previously recognized.", "main_contribution": {"headline": "Iterations by Regimenting Self-Attention (IRSA) triggers GPT-3 to execute programs", "description": "The paper introduces a novel method, Iterations by Regimenting Self-Attention (IRSA), to trigger GPT-3 models to execute programs that involve loops. This is achieved by using strong repetitive structure in an example of an execution path of a target program, prompting with fragments of execution paths, or explicitly forbidding self-attention to parts of the generated text. The authors demonstrate that IRSA leads to larger accuracy gains in dynamic program execution than upgrading to a more powerful model like GPT-4. The findings suggest that prompt design plays a critical role in LLM performance."}, "takeaways": {"headline": "IRSA can be used to improve LLMs' ability to execute complex tasks", "description": "The IRSA method can be used to enhance the performance of LLMs in executing complex tasks, such as those involving loops. By carefully designing prompts, practitioners can trigger algorithmic behaviour in LLMs, enabling them to solve problems previously considered difficult. This approach can be particularly useful in educational settings, where the prompts and responses resemble student assignments in data structures and algorithms classes.", "example": "For instance, to make an LLM execute a loop-based algorithm, one could use IRSA by providing a prompt with a strong repetitive structure that mirrors the execution path of the algorithm. This could trigger the LLM to not only understand the algorithm but also execute it for different inputs."}, "category": "PROMPTING", "novelty_analysis": "The paper presents a novel approach to triggering algorithmic behaviour in LLMs, particularly in executing loop-based programs. The introduction of IRSA and its demonstrated effectiveness in improving LLM performance represents a significant advancement in the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it delves into the details of the IRSA method and its application in triggering algorithmic behaviour in LLMs. However, it does not involve complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and programming.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an intriguing contribution to the field of LLMs. The introduction of IRSA and its potential applications make the paper an interesting read for those interested in enhancing the capabilities of LLMs.", "enjoyable_score": 3}