{"Published": "2023-03-09", "Title": "Seeing ChatGPT Through Students' Eyes: An Analysis of TikTok Data", "Authors": "Anna-Carolina Haensch, Sarah Ball, Markus Herklotz, Frauke Kreuter", "Summary": "Advanced large language models like ChatGPT have gained considerable attention recently, including among students. However, while the debate on ChatGPT in academia is making waves, more understanding is needed among lecturers and teachers on how students use and perceive ChatGPT. To address this gap, we analyzed the content on ChatGPT available on TikTok in February 2023. TikTok is a rapidly growing social media platform popular among individuals under 30. Specifically, we analyzed the content of the 100 most popular videos in English tagged with #chatgpt, which collectively garnered over 250 million views. Most of the videos we studied promoted the use of ChatGPT for tasks like writing essays or code. In addition, many videos discussed AI detectors, with a focus on how other tools can help to transform ChatGPT output to fool these detectors. This also mirrors the discussion among educators on how to treat ChatGPT as lecturers and teachers in teaching and grading. What is, however, missing from the analyzed clips on TikTok are videos that discuss ChatGPT producing content that is nonsensical or unfaithful to the training data.", "main_contribution": {"headline": "Analysis of Student Perception and Use of ChatGPT via TikTok Content", "description": "This paper provides a unique perspective on how students perceive and use ChatGPT by analyzing content on TikTok, a popular social media platform among individuals under 30. The authors analyzed the 100 most popular English videos tagged with #chatgpt, which collectively garnered over 250 million views. The study found that most videos promoted the use of ChatGPT for tasks like writing essays or code, and many discussed AI detectors and how to transform ChatGPT output to fool these detectors. However, videos discussing ChatGPT producing nonsensical or unfaithful content were notably absent."}, "takeaways": {"headline": "Insights into Student Perception and Use of ChatGPT Can Inform Educational Strategies", "description": "The paper's findings can help educators and AI practitioners understand how students perceive and use ChatGPT, which can inform strategies for incorporating or regulating AI tools in educational settings. For instance, the popularity of videos promoting the use of ChatGPT for writing essays or code suggests that students find these applications of ChatGPT particularly useful. The discussion of AI detectors indicates that students are aware of and interested in the potential for AI to detect and transform ChatGPT output. These insights can guide the development of educational resources and policies regarding the use of AI tools like ChatGPT.", "example": "For example, educators could develop guidelines for using ChatGPT as a tool for writing essays or code, or they could incorporate discussions of AI detectors into their curriculum to foster critical thinking about AI and its potential uses and abuses."}, "category": "BEHAVIOR", "novelty_analysis": "The paper's approach of analyzing TikTok content to understand student perceptions and uses of ChatGPT is novel. While previous studies have explored the impact of AI language models on academic teaching and learning, this is the first to do so through the lens of social media content created by students themselves.", "novelty_score": 3, "technical_analysis": "The paper is not very technical. It focuses on analyzing social media content and does not delve into the technical details of how ChatGPT works or how it is used in specific tasks.", "technical_score": 1, "enjoyable_analysis": "The paper is enjoyable for its novel approach and its insights into how students perceive and use ChatGPT. It is well-written and accessible to a wide audience, including those without a technical background in AI or machine learning.", "enjoyable_score": 3}