{"Published": "2023-05-20", "Title": "VNHSGE: VietNamese High School Graduation Examination Dataset for Large Language Models", "Authors": "Xuan-Quy Dao, Ngoc-Bich Le, The-Duy Vo, Xuan-Dung Phan, Bac-Bien Ngo, Van-Tien Nguyen, Thi-My-Thanh Nguyen, Hong-Phuoc Nguyen", "Summary": "The VNHSGE (VietNamese High School Graduation Examination) dataset, developed exclusively for evaluating large language models (LLMs), is introduced in this article. The dataset, which covers nine subjects, was generated from the Vietnamese National High School Graduation Examination and comparable tests. 300 literary essays have been included, and there are over 19,000 multiple-choice questions on a range of topics. The dataset assesses LLMs in multitasking situations such as question answering, text generation, reading comprehension, visual question answering, and more by including both textual data and accompanying images. Using ChatGPT and BingChat, we evaluated LLMs on the VNHSGE dataset and contrasted their performance with that of Vietnamese students to see how well they performed. The results show that ChatGPT and BingChat both perform at a human level in a number of areas, including literature, English, history, geography, and civics education. They still have space to grow, though, especially in the areas of mathematics, physics, chemistry, and biology. The VNHSGE dataset seeks to provide an adequate benchmark for assessing the abilities of LLMs with its wide-ranging coverage and variety of activities. We intend to promote future developments in the creation of LLMs by making this dataset available to the scientific community, especially in resolving LLMs' limits in disciplines involving mathematics and the natural sciences.", "main_contribution": {"headline": "Introduction of VNHSGE Dataset for Evaluating Large Language Models", "description": "The paper introduces the VNHSGE (VietNamese High School Graduation Examination) dataset, specifically designed for evaluating large language models (LLMs). The dataset, derived from the Vietnamese National High School Graduation Examination and similar tests, covers nine subjects and includes over 19,000 multiple-choice questions and 300 literary essays. It is designed to assess LLMs in multitasking situations, including question answering, text generation, reading comprehension, and visual question answering. The authors evaluated LLMs using ChatGPT and BingChat on the VNHSGE dataset, comparing their performance with that of Vietnamese students."}, "takeaways": {"headline": "VNHSGE Dataset Provides Comprehensive Benchmark for LLM Evaluation", "description": "The VNHSGE dataset provides a comprehensive benchmark for evaluating the abilities of LLMs across a wide range of tasks and subjects. It can be used to identify areas where LLMs perform at a human level and areas where they need improvement. The dataset's wide coverage and variety of tasks make it a valuable resource for LLM practitioners looking to evaluate and improve their models. The authors' evaluation of ChatGPT and BingChat on the VNHSGE dataset provides a practical example of how the dataset can be used.", "example": "For instance, an LLM practitioner could use the VNHSGE dataset to evaluate their model's performance across a range of tasks and subjects. They could then use this information to identify areas where the model performs well and areas where it needs improvement, and adjust their training and fine-tuning strategies accordingly."}, "category": "TRAINING", "novelty_analysis": "The introduction of the VNHSGE dataset is a novel contribution to the field of LLMs. While there are other datasets available for evaluating LLMs, the VNHSGE dataset is unique in its wide coverage of subjects and tasks, and its focus on evaluating LLMs in multitasking situations.", "novelty_score": 3, "technical_analysis": "The paper is not overly technical. It focuses on the introduction and description of the VNHSGE dataset, and the evaluation of LLMs using this dataset, without delving into complex mathematical theories or algorithms.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and organized, and presents a novel and interesting contribution to the field of LLMs. The comparison of LLM performance with that of Vietnamese students adds an interesting real-world context to the evaluation.", "enjoyable_score": 3}