{"Published": "2023-06-30", "Title": "Generative AI for Programming Education: Benchmarking ChatGPT, GPT-4, and Human Tutors", "Authors": "Tung Phung, Victor-Alexandru Pădurean, José Cambronero, Sumit Gulwani, Tobias Kohn, Rupak Majumdar, Adish Singla, Gustavo Soares", "Summary": "Generative AI and large language models hold great promise in enhancing computing education by powering next-generation educational technologies for introductory programming. Recent works have studied these models for different scenarios relevant to programming education; however, these works are limited for several reasons, as they typically consider already outdated models or only specific scenario(s). Consequently, there is a lack of a systematic study that benchmarks state-of-the-art models for a comprehensive set of programming education scenarios. In our work, we systematically evaluate two models, ChatGPT (based on GPT-3.5) and GPT-4, and compare their performance with human tutors for a variety of scenarios. We evaluate using five introductory Python programming problems and real-world buggy programs from an online platform, and assess performance using expert-based annotations. Our results show that GPT-4 drastically outperforms ChatGPT (based on GPT-3.5) and comes close to human tutors' performance for several scenarios. These results also highlight settings where GPT-4 still struggles, providing exciting future directions on developing techniques to improve the performance of these models.", "main_contribution": {"headline": "Systematic Evaluation of ChatGPT and GPT-4 for Programming Education", "description": "This paper presents a comprehensive evaluation of two state-of-the-art Large Language Models (LLMs), ChatGPT (based on GPT-3.5) and GPT-4, in the context of programming education. The authors compare the performance of these models with human tutors across six different scenarios: program repair, hint generation, grading feedback, pair programming, contextualized explanation, and task creation. The evaluation is conducted using five introductory Python programming problems and real-world buggy programs from an online platform, with performance assessed using expert-based annotations."}, "takeaways": {"headline": "GPT-4 Shows Promise as a Tool for Programming Education", "description": "The findings of this paper suggest that GPT-4 can be a powerful tool for programming education, outperforming ChatGPT and coming close to the performance of human tutors in several scenarios. However, the paper also highlights areas where GPT-4 still struggles, indicating potential directions for future research and improvement. For practitioners, this suggests that LLMs can be effectively used to enhance programming education, but also that there is still room for improvement in their performance.", "example": "For instance, an LLM like GPT-4 could be used as a digital tutor to provide hints and feedback to students learning Python programming. However, the model's performance might need to be improved in certain areas, such as generating contextualized explanations or creating new tasks."}, "category": "USE CASES", "novelty_analysis": "The paper provides a systematic evaluation of state-of-the-art LLMs in the context of programming education, which is a novel contribution. However, the use of LLMs in education is not a new concept, and the models evaluated in the paper are existing models rather than new ones developed by the authors.", "novelty_score": 2, "technical_analysis": "The paper is somewhat technical, as it involves a detailed evaluation of LLMs and a comparison of their performance with human tutors. However, it does not delve into the inner workings of the models or introduce new algorithms or techniques, making it accessible to readers with a basic understanding of LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents interesting findings about the potential of LLMs in programming education. However, the technical nature of the evaluation and the focus on specific scenarios in programming education may limit its appeal to a broader audience.", "enjoyable_score": 2}