{"Published": "2023-06-13", "Title": "WebGLM: Towards An Efficient Web-Enhanced Question Answering System with Human Preferences", "Authors": "Xiao Liu, Hanyu Lai, Hao Yu, Yifan Xu, Aohan Zeng, Zhengxiao Du, Peng Zhang, Yuxiao Dong, Jie Tang", "Summary": "We present WebGLM, a web-enhanced question-answering system based on the General Language Model (GLM). Its goal is to augment a pre-trained large language model (LLM) with web search and retrieval capabilities while being efficient for real-world deployments. To achieve this, we develop WebGLM with strategies for the LLM-augmented retriever, bootstrapped generator, and human preference-aware scorer. Specifically, we identify and address the limitations of WebGPT (OpenAI), through which WebGLM is enabled with accuracy, efficiency, and cost-effectiveness advantages. In addition, we propose systematic criteria for evaluating web-enhanced QA systems. We conduct multi-dimensional human evaluation and quantitative ablation studies, which suggest the outperformance of the proposed WebGLM designs over existing systems. WebGLM with the 10-billion-parameter GLM (10B) is shown to perform better than the similar-sized WebGPT (13B) and even comparably to WebGPT (175B) in human evaluation. The code, demo, and data are at \\url{https://github.com/THUDM/WebGLM}.", "main_contribution": {"headline": "WebGLM: An Efficient Web-Enhanced Question Answering System with Human Preferences", "description": "The paper introduces WebGLM, a web-enhanced question-answering system based on the General Language Model (GLM). The system aims to augment a pre-trained large language model (LLM) with web search and retrieval capabilities, making it efficient for real-world deployments. WebGLM is developed with strategies for the LLM-augmented retriever, bootstrapped generator, and human preference-aware scorer. The authors identify and address the limitations of WebGPT (OpenAI), enabling WebGLM with accuracy, efficiency, and cost-effectiveness advantages. They also propose systematic criteria for evaluating web-enhanced QA systems."}, "takeaways": {"headline": "WebGLM offers a new approach to web-enhanced question answering with LLMs", "description": "WebGLM presents a new approach to augmenting LLMs with web search and retrieval capabilities, which can be beneficial for practitioners working on question-answering systems. The strategies for the LLM-augmented retriever, bootstrapped generator, and human preference-aware scorer can be used to improve the accuracy, efficiency, and cost-effectiveness of such systems. The proposed systematic criteria for evaluating web-enhanced QA systems can also provide a standard for future research and development in this area.", "example": "For instance, to implement a web-enhanced QA system using WebGLM, one could follow these steps: 1. Train a GLM with web search and retrieval capabilities. 2. Develop an LLM-augmented retriever to fetch relevant information from the web. 3. Implement a bootstrapped generator to generate responses based on the retrieved information. 4. Use a human preference-aware scorer to rank the generated responses. 5. Evaluate the system using the proposed systematic criteria."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel approach to web-enhanced question answering with LLMs, addressing the limitations of existing systems like WebGPT. The introduction of WebGLM, along with the strategies for the LLM-augmented retriever, bootstrapped generator, and human preference-aware scorer, represents a significant advancement in the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it delves into the details of WebGLM and its components. However, it does not require advanced mathematical knowledge, and the concepts are explained in a way that is accessible to readers with a background in AI and machine learning.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and interesting contribution to the field of LLMs. The clear explanations of the concepts and the practical implications of the research make it an enjoyable read.", "enjoyable_score": 3}