{"Published": "2023-06-12", "Title": "Large Language Models as Tax Attorneys: A Case Study in Legal Capabilities Emergence", "Authors": "John J. Nay, David Karamardian, Sarah B. Lawsky, Wenting Tao, Meghana Bhat, Raghav Jain, Aaron Travis Lee, Jonathan H. Choi, Jungo Kasai", "Summary": "Better understanding of Large Language Models' (LLMs) legal analysis abilities can contribute to improving the efficiency of legal services, governing artificial intelligence, and leveraging LLMs to identify inconsistencies in law. This paper explores LLM capabilities in applying tax law. We choose this area of law because it has a structure that allows us to set up automated validation pipelines across thousands of examples, requires logical reasoning and maths skills, and enables us to test LLM capabilities in a manner relevant to real-world economic lives of citizens and companies. Our experiments demonstrate emerging legal understanding capabilities, with improved performance in each subsequent OpenAI model release. We experiment with retrieving and utilising the relevant legal authority to assess the impact of providing additional legal context to LLMs. Few-shot prompting, presenting examples of question-answer pairs, is also found to significantly enhance the performance of the most advanced model, GPT-4. The findings indicate that LLMs, particularly when combined with prompting enhancements and the correct legal texts, can perform at high levels of accuracy but not yet at expert tax lawyer levels. As LLMs continue to advance, their ability to reason about law autonomously could have significant implications for the legal profession and AI governance.", "main_contribution": {"headline": "Exploration of LLMs' capabilities in legal analysis, specifically tax law", "description": "The paper investigates the legal analysis capabilities of Large Language Models (LLMs), focusing on tax law. The authors chose tax law due to its structured nature, which allows for automated validation pipelines across numerous examples. The study demonstrates that LLMs, particularly when combined with few-shot prompting and the correct legal texts, can perform at high levels of accuracy, albeit not yet at expert tax lawyer levels. The research also shows that the performance of LLMs in legal understanding has improved with each subsequent OpenAI model release."}, "takeaways": {"headline": "LLMs can be leveraged for legal analysis tasks, with potential for future improvements", "description": "The paper suggests that LLMs can be effectively used for legal analysis tasks, specifically in the domain of tax law. The use of few-shot prompting and providing the correct legal texts can significantly enhance the performance of LLMs. However, it's important to note that while LLMs can perform at high levels of accuracy, they are not yet at the level of expert tax lawyers. As LLMs continue to advance, their ability to reason about law autonomously could have significant implications for the legal profession and AI governance.", "example": "For instance, an LLM could be used to analyze a tax law case. By providing the LLM with the relevant legal texts and using few-shot prompting, the LLM could provide a legal analysis of the case with a high level of accuracy."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel exploration of the capabilities of LLMs in the domain of legal analysis, specifically tax law. While the use of LLMs in various domains has been explored, their application in legal analysis, and tax law in particular, is a unique contribution.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it delves into the specifics of how LLMs can be used for legal analysis. However, it does not delve into complex mathematical theories or algorithms, making it accessible to a wider audience.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents an interesting exploration of the capabilities of LLMs in a novel domain. The implications of the findings for the legal profession and AI governance make for an engaging read.", "enjoyable_score": 3}