{"Published": "2023-07-26", "Title": "Large Language Models are Competitive Near Cold-start Recommenders for Language- and Item-based Preferences", "Authors": "Scott Sanner, Krisztian Balog, Filip Radlinski, Ben Wedin, Lucas Dixon", "Summary": "Traditional recommender systems leverage users' item preference history to recommend novel content that users may like. However, modern dialog interfaces that allow users to express language-based preferences offer a fundamentally different modality for preference input. Inspired by recent successes of prompting paradigms for large language models (LLMs), we study their use for making recommendations from both item-based and language-based preferences in comparison to state-of-the-art item-based collaborative filtering (CF) methods. To support this investigation, we collect a new dataset consisting of both item-based and language-based preferences elicited from users along with their ratings on a variety of (biased) recommended items and (unbiased) random items. Among numerous experimental results, we find that LLMs provide competitive recommendation performance for pure language-based preferences (no item preferences) in the near cold-start case in comparison to item-based CF methods, despite having no supervised training for this specific task (zero-shot) or only a few labels (few-shot). This is particularly promising as language-based preference representations are more explainable and scrutable than item-based or vector-based representations.", "main_contribution": {"headline": "LLMs as Competitive Near Cold-start Recommenders for Language- and Item-based Preferences", "description": "The paper investigates the use of Large Language Models (LLMs) for making recommendations based on both item-based and language-based preferences, comparing them to traditional item-based collaborative filtering (CF) methods. The authors collected a new dataset of both item-based and language-based preferences from users, along with their ratings on recommended and random items. The study found that LLMs provide competitive recommendation performance for pure language-based preferences in near cold-start cases, even without supervised training for this specific task or with only a few labels. This suggests that language-based preference representations are more explainable and scrutable than item-based or vector-based representations."}, "takeaways": {"headline": "LLMs can be used as effective recommenders in near cold-start scenarios", "description": "The findings of this paper suggest that LLMs can be used effectively in recommendation systems, particularly in near cold-start scenarios where there is little to no usage data available. This is particularly useful in modern dialog interfaces that allow users to express language-based preferences. The use of LLMs in this context provides a more explainable and scrutible representation of user preferences, which can be beneficial in applications where transparency and user control over personalization are important.", "example": "For instance, in a movie recommendation system, instead of relying solely on item-based preferences (e.g., user's movie history), an LLM can be used to interpret language-based preferences expressed by the user (e.g., 'I like suspenseful thrillers with unexpected plot twists'). The LLM can then generate recommendations based on this input, even in a cold-start scenario where the user has no previous movie history in the system."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel application of LLMs in recommendation systems, particularly in near cold-start scenarios. The use of LLMs for interpreting language-based preferences and generating recommendations is a unique approach that differs from traditional item-based collaborative filtering methods.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it involves the use of LLMs in a specific application (recommendation systems) and involves the collection and analysis of a new dataset. However, the concepts are explained clearly and should be accessible to readers with a basic understanding of LLMs and recommendation systems.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting application of LLMs in recommendation systems. The findings are significant and have practical implications, making the paper an enjoyable read for those interested in the application of LLMs in real-world scenarios.", "enjoyable_score": 3}