{"Published": "2023-07-05", "Title": "Becoming self-instruct: introducing early stopping criteria for minimal instruct tuning", "Authors": "Waseem AlShikh, Manhal Daaboul, Kirk Goddard, Brock Imel, Kiran Kamble, Parikshith Kulkarni, Melisa Russak", "Summary": "In this paper, we introduce the Instruction Following Score (IFS), a metric that detects language models' ability to follow instructions. The metric has a dual purpose. First, IFS can be used to distinguish between base and instruct models. We benchmark publicly available base and instruct models, and show that the ratio of well formatted responses to partial and full sentences can be an effective measure between those two model classes. Secondly, the metric can be used as an early stopping criteria for instruct tuning. We compute IFS for Supervised Fine-Tuning (SFT) of 7B and 13B LLaMA models, showing that models learn to follow instructions relatively early in the training process, and the further finetuning can result in changes in the underlying base model semantics. As an example of semantics change we show the objectivity of model predictions, as defined by an auxiliary metric ObjecQA. We show that in this particular case, semantic changes are the steepest when the IFS tends to plateau. We hope that decomposing instruct tuning into IFS and semantic factors starts a new trend in better controllable instruct tuning and opens possibilities for designing minimal instruct interfaces querying foundation models.", "main_contribution": {"headline": "Introduction of Instruction Following Score (IFS) for better instruct tuning", "description": "The paper introduces the Instruction Following Score (IFS), a novel metric to evaluate the ability of language models to follow instructions. The IFS serves two main purposes: distinguishing between base and instruct models, and acting as an early stopping criterion for instruct tuning. The authors demonstrate the utility of IFS through Supervised Fine-Tuning (SFT) of 7B and 13B LLaMA models, showing that models learn to follow instructions early in the training process. They also highlight that further fine-tuning can alter the base model semantics, with the steepest semantic changes occurring when the IFS plateaus."}, "takeaways": {"headline": "IFS provides a new approach to control instruct tuning in LLMs", "description": "The Instruction Following Score (IFS) provides a new way to control the instruct tuning process in Large Language Models (LLMs). It can be used to distinguish between base and instruct models, and as an early stopping criterion for instruct tuning. This can help in preventing unnecessary changes in the underlying base model semantics during the fine-tuning process. The IFS can be particularly useful for LLM practitioners aiming to design minimal instruct interfaces querying foundation models.", "example": "For instance, while fine-tuning an LLM, one can monitor the IFS. If the IFS starts to plateau, it might be a good idea to stop the fine-tuning process to prevent unnecessary changes in the base model semantics."}, "category": "FINE-TUNING", "novelty_analysis": "The introduction of the Instruction Following Score (IFS) as a metric for evaluating the ability of language models to follow instructions and as an early stopping criterion for instruct tuning is a novel contribution. It provides a new perspective on controlling the instruct tuning process in Large Language Models (LLMs).", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it introduces a new metric and discusses its application in the context of Supervised Fine-Tuning (SFT) of Large Language Models (LLMs). However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs and fine-tuning processes.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel concept in a clear and concise manner. The practical implications of the Instruction Following Score (IFS) for LLM practitioners are well-highlighted, making the paper an interesting read for those working in the field.", "enjoyable_score": 3}