{"Published": "2023-07-19", "Title": "On the Origin of LLMs: An Evolutionary Tree and Graph for 15,821 Large Language Models", "Authors": "Sarah Gao, Andrew Kean Gao", "Summary": "Since late 2022, Large Language Models (LLMs) have become very prominent with LLMs like ChatGPT and Bard receiving millions of users. Hundreds of new LLMs are announced each week, many of which are deposited to Hugging Face, a repository of machine learning models and datasets. To date, nearly 16,000 Text Generation models have been uploaded to the site. Given the huge influx of LLMs, it is of interest to know which LLM backbones, settings, training methods, and families are popular or trending. However, there is no comprehensive index of LLMs available. We take advantage of the relatively systematic nomenclature of Hugging Face LLMs to perform hierarchical clustering and identify communities amongst LLMs using n-grams and term frequency-inverse document frequency. Our methods successfully identify families of LLMs and accurately cluster LLMs into meaningful subgroups. We present a public web application to navigate and explore Constellation, our atlas of 15,821 LLMs. Constellation rapidly generates a variety of visualizations, namely dendrograms, graphs, word clouds, and scatter plots. Constellation is available at the following link: https://constellation.sites.stanford.edu/.", "main_contribution": {"headline": "Hierarchical clustering and community detection for organizing and visualizing Large Language Models", "description": "The paper presents a novel approach to organize and visualize the vast number of Large Language Models (LLMs) available on the Hugging Face repository. The authors use hierarchical clustering and community detection techniques to identify families and subgroups of LLMs. They also infer model parameters from the model names using regular expressions. The result is a web application named Constellation, which serves as an atlas of LLMs, offering various visualizations such as dendrograms, graphs, word clouds, and scatter plots."}, "takeaways": {"headline": "Constellation provides a comprehensive index of LLMs, aiding in model selection and trend identification", "description": "The Constellation web application can be a valuable tool for LLM practitioners. It provides a comprehensive index of LLMs, helping users to navigate the vast landscape of models and identify trends in popular backbones, settings, and training methods. By visualizing the LLMs in various ways, it aids in model selection and understanding the relationships between different models. The inferred model parameters can also provide insights into the model's complexity and potential performance.", "example": "For instance, a practitioner looking for a specific type of LLM can use Constellation to identify similar models and their popularity trends. They can also infer the model's size from the inferred parameters, aiding in the selection process."}, "category": "OTHER", "novelty_analysis": "The paper presents a novel approach to organizing and visualizing LLMs, which is a significant contribution given the rapidly growing number of models. However, the techniques used, such as hierarchical clustering and community detection, are well-established in other fields.", "novelty_score": 2, "technical_analysis": "The paper is somewhat technical, as it involves the use of several libraries and techniques for data collection, analysis, and visualization. However, the concepts are explained clearly and should be accessible to anyone with a basic understanding of machine learning and data analysis.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting and practical solution to a real-world problem. The use of visualizations and the creation of a web application make the findings accessible and engaging for a wide audience.", "enjoyable_score": 3}