{"Published": "2023-05-11", "Title": "Active Retrieval Augmented Generation", "Authors": "Zhengbao Jiang, Frank F. Xu, Luyu Gao, Zhiqing Sun, Qian Liu, Jane Dwivedi-Yu, Yiming Yang, Jamie Callan, Graham Neubig", "Summary": "Despite the remarkable ability of large language models (LMs) to comprehend and generate language, they have a tendency to hallucinate and create factually inaccurate output. Augmenting LMs by retrieving information from external knowledge resources is one promising solution. Most existing retrieval-augmented LMs employ a retrieve-and-generate setup that only retrieves information once based on the input. This is limiting, however, in more general scenarios involving generation of long texts, where continually gathering information throughout the generation process is essential. There have been some past efforts to retrieve information multiple times while generating outputs, which mostly retrieve documents at fixed intervals using the previous context as queries. In this work, we provide a generalized view of active retrieval augmented generation, methods that actively decide when and what to retrieve across the course of the generation. We propose Forward-Looking Active REtrieval augmented generation (FLARE), a generic retrieval-augmented generation method which iteratively uses a prediction of the upcoming sentence to anticipate future content, which is then utilized as a query to retrieve relevant documents to regenerate the sentence if it contains low-confidence tokens. We test FLARE along with baselines comprehensively over 4 long-form knowledge-intensive generation tasks/datasets. FLARE achieves superior or competitive performance on all tasks, demonstrating the effectiveness of our method. Code and datasets are available at https://github.com/jzbjyb/FLARE.", "main_contribution": {"headline": "FLARE: A Forward-Looking Active Retrieval Augmented Generation Method for LLMs", "description": "The paper introduces Forward-Looking Active REtrieval augmented generation (FLARE), a novel method for retrieval-augmented Large Language Models (LLMs). FLARE actively decides when and what to retrieve during the generation process, addressing the limitations of existing retrieval-augmented LLMs that only retrieve information once based on the input. FLARE uses a prediction of the upcoming sentence to anticipate future content, which is then used as a query to retrieve relevant documents. If the sentence contains low-confidence tokens, it is regenerated. This method is particularly useful in scenarios involving the generation of long texts, where continually gathering information throughout the process is essential. The authors demonstrate the effectiveness of FLARE by testing it comprehensively over four long-form knowledge-intensive generation tasks/datasets."}, "takeaways": {"headline": "FLARE Enhances LLMs' Ability to Generate Long, Factually Accurate Texts", "description": "FLARE's active retrieval strategy can significantly improve the performance of LLMs in generating long, factually accurate texts. By actively deciding when and what to retrieve throughout the generation process, FLARE can continually gather information, making it particularly useful for tasks such as long-form question answering, open-domain summarization, and commonsense reasoning. The method is applicable to any existing LLMs at inference time without additional training, making it a versatile tool for LLM practitioners.", "example": "For instance, when generating a long-form summary about a specific topic, an LLM equipped with FLARE can iteratively generate a temporary next sentence, use it as a query to retrieve relevant documents if it contains low-confidence tokens, and regenerate the sentence until it reaches the end. This process ensures that the generated summary is factually accurate and covers all necessary aspects of the topic."}, "category": "FINE-TUNING", "novelty_analysis": "FLARE presents a novel approach to retrieval-augmented generation in LLMs. Unlike existing methods that only retrieve information once based on the input, FLARE actively decides when and what to retrieve throughout the generation process. This forward-looking active retrieval strategy is a significant advancement in the field of LLMs, particularly for tasks involving the generation of long, factually accurate texts.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, detailing the workings of the FLARE method and its application in various tasks. It delves into the specifics of how FLARE uses a prediction of the upcoming sentence to anticipate future content and retrieve relevant documents. However, the concepts are explained clearly, making it accessible to readers with a basic understanding of LLMs and retrieval-augmented generation.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel approach to retrieval-augmented generation in LLMs. The clear explanation of the FLARE method and its application, along with comprehensive testing results, make for an engaging read. The paper effectively demonstrates the practical implications of FLARE, providing valuable insights for LLM practitioners.", "enjoyable_score": 2}