{"Published": "2023-03-21", "Title": "Artificial muses: Generative Artificial Intelligence Chatbots Have Risen to Human-Level Creativity", "Authors": "Jennifer Haase, Paul H. P. Hanel", "Summary": "A widespread view is that Artificial Intelligence cannot be creative. We tested this assumption by comparing human-generated ideas with those generated by six Generative Artificial Intelligence (GAI) chatbots: $alpa.\\!ai$, $Copy.\\!ai$, ChatGPT (versions 3 and 4), $Studio.\\!ai$, and YouChat. Humans and a specifically trained AI independently assessed the quality and quantity of ideas. We found no qualitative difference between AI and human-generated creativity, although there are differences in how ideas are generated. Interestingly, 9.4 percent of humans were more creative than the most creative GAI, GPT-4. Our findings suggest that GAIs are valuable assistants in the creative process. Continued research and development of GAI in creative tasks is crucial to fully understand this technology's potential benefits and drawbacks in shaping the future of creativity. Finally, we discuss the question of whether GAIs are capable of being truly creative.", "main_contribution": {"headline": "Generative AI Chatbots Exhibit Human-Level Creativity", "description": "The paper challenges the assumption that Artificial Intelligence (AI) cannot be creative by comparing the ideas generated by humans and six Generative Artificial Intelligence (GAI) chatbots. The chatbots were assessed on the quality and quantity of their ideas by both humans and a specifically trained AI. The study found no qualitative difference between AI and human-generated creativity, although there were differences in the idea generation process. Interestingly, only 9.4% of humans were found to be more creative than the most creative GAI, GPT-4. The paper concludes that GAIs can be valuable assistants in the creative process and encourages further research and development of GAI in creative tasks."}, "takeaways": {"headline": "GAIs Can Enhance Human Creativity in Various Domains", "description": "The findings of this study suggest that GAIs can be used to support and enhance human creativity. The chatbots were found to generate a vast amount of new textual and visual output based on written prompts, similar to human free-associative thinking. This capability can be leveraged to support human tasks in various domains, including healthcare, education, and entertainment. However, the study also highlights that the creative output of GAIs is dependent on human input and further processing, suggesting that GAIs currently play an assistance role in the creative process.", "example": "For instance, in a brainstorming session, a GAI chatbot can be used to generate a large number of ideas based on a specific prompt provided by a human. The human can then select and further develop the most promising ideas."}, "category": "BEHAVIOR", "novelty_analysis": "The paper presents a novel approach to evaluating the creativity of GAIs by comparing their output with that of humans. The use of both human and AI assessors adds a unique perspective to the evaluation process. The finding that GAIs can generate ideas that are as original as those generated by humans is a significant contribution to the field of AI creativity.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the use of GAIs in creative tasks and the evaluation of their output. However, it does not delve into the technical details of the GAI algorithms or their implementation, making it accessible to a wider audience.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting exploration of the creative capabilities of GAIs. The use of clear language and the inclusion of practical examples make it an enjoyable read for both technical and non-technical audiences.", "enjoyable_score": 3}