{"Published": "2023-01-28", "Title": "Large Language Models as Corporate Lobbyists", "Authors": "John J. Nay", "Summary": "We demonstrate a proof-of-concept of a large language model conducting corporate lobbying related activities. An autoregressive large language model (OpenAI's text-davinci-003) determines if proposed U.S. Congressional bills are relevant to specific public companies and provides explanations and confidence levels. For the bills the model deems as relevant, the model drafts a letter to the sponsor of the bill in an attempt to persuade the congressperson to make changes to the proposed legislation. We use hundreds of novel ground-truth labels of the relevance of a bill to a company to benchmark the performance of the model. It outperforms the baseline of predicting the most common outcome of irrelevance. We also benchmark the performance of the previous OpenAI GPT-3 model (text-davinci-002), which was the state-of-the-art model on many academic natural language tasks until text-davinci-003 was recently released. The performance of text-davinci-002 is worse than the simple baseline. Longer-term, if AI begins to influence law in a manner that is not a direct extension of human intentions, this threatens the critical role that law as information could play in aligning AI with humans. Initially, AI is being used to simply augment human lobbyists for a small portion of their daily tasks. However, firms have an incentive to use less and less human oversight over automated assessments of policy ideas and the written communication to regulatory agencies and Congressional staffers. The core question raised is where to draw the line between human-driven and AI-driven policy influence.", "main_contribution": {"headline": "Large Language Models as Corporate Lobbyists: A Proof-of-Concept Study", "description": "The paper presents a proof-of-concept demonstration of a large language model (LLM) conducting corporate lobbying related activities. The LLM, OpenAI's text-davinci-003, is used to determine if proposed U.S. Congressional bills are relevant to specific public companies, provide explanations and confidence levels, and draft a letter to the sponsor of the bill to persuade changes to the proposed legislation. The performance of the LLM is benchmarked against the most common outcome of irrelevance and the previous OpenAI GPT-3 model (text-davinci-002). The results suggest that as LLMs continue to improve, their performance on lobbying related tasks will also improve. The paper raises critical questions about the boundary between human-driven and AI-driven policy influence."}, "takeaways": {"headline": "LLMs Can Be Utilized for Corporate Lobbying Activities", "description": "The paper demonstrates that LLMs can be used to perform tasks related to corporate lobbying, such as assessing the relevance of proposed bills to specific companies and drafting persuasive letters to bill sponsors. This opens up new possibilities for automating parts of the lobbying process, potentially reducing costs and increasing efficiency for firms. However, it also raises important ethical and regulatory questions about the extent to which AI should be allowed to influence policy. The paper's findings could be used to inform the development of AI systems for policy analysis and advocacy, as well as the design of regulations governing the use of AI in lobbying.", "example": "For example, a company could use an LLM to monitor proposed legislation and identify bills that could impact its business. The LLM could then draft a letter to the bill's sponsor, arguing for changes that would benefit the company. This could save the company time and resources, while also ensuring that it is aware of and able to respond to relevant policy developments."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel application of LLMs in the field of corporate lobbying. While LLMs have been used in a variety of contexts, this is the first study to demonstrate their potential use in assessing the relevance of proposed legislation to specific companies and drafting persuasive letters to lawmakers. The paper also raises important questions about the ethical and regulatory implications of using AI in this way.", "novelty_score": 3, "technical_analysis": "The paper is not overly technical. It describes the use of an existing LLM (OpenAI's text-davinci-003) in a new context, but does not delve into the technical details of how the model works. The focus is more on the application of the model and the implications of its use, rather than the underlying technology.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and presents an interesting and novel application of LLMs. It raises important questions about the use of AI in policy-making and lobbying, making it a thought-provoking read. The clear presentation of the methodology and results, along with the discussion of ethical and regulatory implications, make it an engaging and informative paper.", "enjoyable_score": 3}