{"Published": "2023-03-08", "Title": "Visual ChatGPT: Talking, Drawing and Editing with Visual Foundation Models", "Authors": "Chenfei Wu, Shengming Yin, Weizhen Qi, Xiaodong Wang, Zecheng Tang, Nan Duan", "Summary": "ChatGPT is attracting a cross-field interest as it provides a language interface with remarkable conversational competency and reasoning capabilities across many domains. However, since ChatGPT is trained with languages, it is currently not capable of processing or generating images from the visual world. At the same time, Visual Foundation Models, such as Visual Transformers or Stable Diffusion, although showing great visual understanding and generation capabilities, they are only experts on specific tasks with one-round fixed inputs and outputs. To this end, We build a system called \\textbf{Visual ChatGPT}, incorporating different Visual Foundation Models, to enable the user to interact with ChatGPT by 1) sending and receiving not only languages but also images 2) providing complex visual questions or visual editing instructions that require the collaboration of multiple AI models with multi-steps. 3) providing feedback and asking for corrected results. We design a series of prompts to inject the visual model information into ChatGPT, considering models of multiple inputs/outputs and models that require visual feedback. Experiments show that Visual ChatGPT opens the door to investigating the visual roles of ChatGPT with the help of Visual Foundation Models. Our system is publicly available at \\url{https://github.com/microsoft/visual-chatgpt}.", "main_contribution": {"headline": "Visual ChatGPT: A System for Visual Understanding and Generation in Conversational AI", "description": "The paper presents Visual ChatGPT, a system that combines the conversational capabilities of ChatGPT with the visual understanding and generation capabilities of Visual Foundation Models (VFMs). Unlike traditional approaches that train a new multimodal model from scratch, Visual ChatGPT is built directly on ChatGPT and incorporates a variety of VFMs. The system uses a Prompt Manager to bridge the gap between ChatGPT and VFMs, converting visual information into language format, handling the histories, priorities, and conflicts of different VFMs, and enabling iterative feedback until user requirements are met or an ending condition is reached. The system is designed to handle complex visual tasks and is publicly available for further investigation and application."}, "takeaways": {"headline": "Visual ChatGPT Enables Complex Visual Interactions in Conversational AI", "description": "Visual ChatGPT opens up new possibilities for integrating visual understanding and generation into conversational AI systems. It allows users to interact with ChatGPT using not only text but also images, and to provide complex visual questions or editing instructions that require the collaboration of multiple AI models. The system's design makes it easy to incorporate new VFMs and modalities, making it a flexible and scalable solution for multimodal conversational AI. For example, a user could upload an image and ask the system to generate a new image based on certain conditions, and the system would leverage multiple VFMs to fulfill the request step by step.", "example": "For instance, a user could upload an image of a yellow flower and enter a complex language instruction 'please generate a red flower conditioned on the predicted depth of this image and then make it like a cartoon, step by step'. Visual ChatGPT would then leverage multiple VFMs to estimate the depth information, generate a red flower image with the depth information, and change the style of the image into a cartoon, providing the final result to the user."}, "category": "ARCHITECTURES", "novelty_analysis": "The paper presents a novel approach to integrating visual understanding and generation into conversational AI. Instead of training a new multimodal model from scratch, the authors propose a system that builds directly on ChatGPT and incorporates a variety of VFMs. This approach is unique and represents a significant advancement in the field of multimodal conversational AI.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the architecture of Visual ChatGPT and the role of the Prompt Manager in bridging the gap between ChatGPT and VFMs. However, the authors do a good job of explaining these concepts in a clear and understandable way, making the paper accessible to readers with a basic understanding of AI and machine learning.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and organized, presenting a novel and intriguing contribution to the field of conversational AI. The authors provide clear explanations of the system's architecture and operation, and the inclusion of a practical example helps to illustrate the system's capabilities in a concrete way.", "enjoyable_score": 3}