{"Published": "2023-02-17", "Title": "Enabling Conversational Interaction with Mobile UI using Large Language Models", "Authors": "Bryan Wang, Gang Li, Yang Li", "Summary": "Conversational agents show the promise to allow users to interact with mobile devices using language. However, to perform diverse UI tasks with natural language, developers typically need to create separate datasets and models for each specific task, which is expensive and effort-consuming. Recently, pre-trained large language models (LLMs) have been shown capable of generalizing to various downstream tasks when prompted with a handful of examples from the target task. This paper investigates the feasibility of enabling versatile conversational interactions with mobile UIs using a single LLM. We designed prompting techniques to adapt an LLM to mobile UIs. We experimented with four important modeling tasks that address various scenarios in conversational interaction. Our method achieved competitive performance on these challenging tasks without requiring dedicated datasets and training, offering a lightweight and generalizable approach to enable language-based mobile interaction.", "main_contribution": {"headline": "Enabling Conversational Interaction with Mobile UI using Large Language Models", "description": "The paper presents a novel approach to enable conversational interaction with mobile user interfaces (UIs) using a single large language model (LLM). The authors designed prompting techniques to adapt an LLM to mobile UIs and experimented with four important modeling tasks that address various scenarios in conversational interaction. The method achieved competitive performance on these challenging tasks without requiring dedicated datasets and training. This approach offers a lightweight and generalizable method to enable language-based mobile interaction. The paper also contributes an algorithm to generate the text representation of mobile UIs, which is essential for LLMs that only take text tokens as input."}, "takeaways": {"headline": "LLMs Can Enable Versatile Conversational Interactions with Mobile UIs", "description": "The paper demonstrates that pre-trained LLMs can be adapted to enable diverse conversational interactions with mobile UIs. This is achieved by designing a set of prompting techniques and an algorithm to generate the text representation of mobile UIs. The approach was tested on four pivotal modeling tasks, demonstrating its feasibility and effectiveness. This work can potentially lower the barriers to developing conversational agents for GUIs. The authors also open-source the code of their algorithm, allowing others to replicate and build upon their work.", "example": "For instance, a mobile app developer could use the proposed method to enable a chatbot within the app to interact with users in a more natural and versatile manner. The chatbot could be prompted to perform tasks such as summarizing a mobile screen, answering user's questions about the screen, or mapping user's instructions to UI actions."}, "category": "PROMPTING", "novelty_analysis": "The paper presents a novel approach to enabling conversational interaction with mobile UIs using a single LLM. The authors designed prompting techniques to adapt an LLM to mobile UIs and experimented with four important modeling tasks. This is the first investigation of using LLMs to enable conversational interaction on mobile UIs, advancing the understanding of using LLMs for interaction tasks.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design of prompting techniques and an algorithm to generate the text representation of mobile UIs. However, the concepts are explained clearly and the paper is accessible to those with a basic understanding of LLMs and mobile UIs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting approach to enabling conversational interaction with mobile UIs using LLMs. The experiments and results are clearly explained, making it an enjoyable read for those interested in the application of LLMs in mobile UIs.", "enjoyable_score": 2}