{"Published": "2023-05-09", "Title": "TidyBot: Personalized Robot Assistance with Large Language Models", "Authors": "Jimmy Wu, Rika Antonova, Adam Kan, Marion Lepert, Andy Zeng, Shuran Song, Jeannette Bohg, Szymon Rusinkiewicz, Thomas Funkhouser", "Summary": "For a robot to personalize physical assistance effectively, it must learn user preferences that can be generally reapplied to future scenarios. In this work, we investigate personalization of household cleanup with robots that can tidy up rooms by picking up objects and putting them away. A key challenge is determining the proper place to put each object, as people's preferences can vary greatly depending on personal taste or cultural background. For instance, one person may prefer storing shirts in the drawer, while another may prefer them on the shelf. We aim to build systems that can learn such preferences from just a handful of examples via prior interactions with a particular person. We show that robots can combine language-based planning and perception with the few-shot summarization capabilities of large language models (LLMs) to infer generalized user preferences that are broadly applicable to future interactions. This approach enables fast adaptation and achieves 91.2% accuracy on unseen objects in our benchmark dataset. We also demonstrate our approach on a real-world mobile manipulator called TidyBot, which successfully puts away 85.0% of objects in real-world test scenarios.", "main_contribution": {"headline": "TidyBot: Personalized Robot Assistance with Large Language Models", "description": "The paper presents TidyBot, a real-world mobile manipulator that uses large language models (LLMs) to personalize household cleanup tasks. The system learns user preferences from a few examples and uses the summarization capabilities of LLMs to generalize these preferences for future interactions. The authors demonstrate that this approach enables fast adaptation and achieves high accuracy on unseen objects. The paper also introduces a publicly released benchmark dataset for evaluating generalization of receptacle selection preferences. The authors' approach avoids the need for expensive collection of user preference data and model training, leveraging the summarization provided by LLMs for generalization in robotics."}, "takeaways": {"headline": "LLMs Enable Personalized Robotics and Fast Adaptation", "description": "The paper shows that LLMs can be effectively used to personalize robotics tasks, such as household cleanup, by learning and generalizing user preferences from a few examples. This approach can be applied to other robotics tasks that require personalization, potentially improving user satisfaction and system efficiency. The authors also provide a benchmark dataset for evaluating generalization of receptacle selection preferences, which can be used by other researchers to compare and improve upon their methods.", "example": "Consider a scenario where a user prefers to store light-colored clothes in a drawer and dark-colored clothes in a closet. After providing a few examples of this preference to TidyBot, the LLM summarizes these examples into a generalized rule. When the robot encounters a new object, such as a light-colored shirt, it uses this rule to determine that the shirt should be placed in the drawer."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel application of LLMs in the field of robotics, specifically for personalizing household cleanup tasks. The use of LLMs to learn and generalize user preferences from a few examples is a unique approach that has not been extensively explored in previous work. The authors also introduce a new benchmark dataset for evaluating generalization of receptacle selection preferences, which is a valuable contribution to the field.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it discusses the use of LLMs for summarization and generalization in robotics, and presents a real-world mobile manipulation system for household cleanup. However, the authors explain their approach clearly and provide sufficient context for readers who may not be familiar with the specific techniques used. The paper also includes a detailed evaluation of the system's performance on a benchmark dataset and in real-world test scenarios.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and organized, presenting a novel and intriguing contribution to the field of robotics. The authors' approach of using LLMs to personalize household cleanup tasks is interesting and has practical implications. The inclusion of a real-world mobile manipulation system, TidyBot, and the evaluation of its performance make the paper engaging and relevant.", "enjoyable_score": 3}