{"Published": "2023-06-27", "Title": "Auditing large language models: a three-layered approach", "Authors": "Jakob Mökander, Jonas Schuett, Hannah Rose Kirk, Luciano Floridi", "Summary": "Large language models (LLMs) represent a major advance in artificial intelligence (AI) research. However, the widespread use of LLMs is also coupled with significant ethical and social challenges. Previous research has pointed towards auditing as a promising governance mechanism to help ensure that AI systems are designed and deployed in ways that are ethical, legal, and technically robust. However, existing auditing procedures fail to address the governance challenges posed by LLMs, which display emergent capabilities and are adaptable to a wide range of downstream tasks. In this article, we address that gap by outlining a novel blueprint for how to audit LLMs. Specifically, we propose a three-layered approach, whereby governance audits (of technology providers that design and disseminate LLMs), model audits (of LLMs after pre-training but prior to their release), and application audits (of applications based on LLMs) complement and inform each other. We show how audits, when conducted in a structured and coordinated manner on all three levels, can be a feasible and effective mechanism for identifying and managing some of the ethical and social risks posed by LLMs. However, it is important to remain realistic about what auditing can reasonably be expected to achieve. Therefore, we discuss the limitations not only of our three-layered approach but also of the prospect of auditing LLMs at all. Ultimately, this article seeks to expand the methodological toolkit available to technology providers and policymakers who wish to analyse and evaluate LLMs from technical, ethical, and legal perspectives.", "main_contribution": {"headline": "A Three-Layered Approach to Auditing Large Language Models", "description": "The paper presents a novel blueprint for auditing Large Language Models (LLMs), addressing the ethical and social challenges associated with their widespread use. The authors propose a three-layered approach to auditing, which includes governance audits of technology providers, model audits of LLMs after pre-training but before release, and application audits of applications based on LLMs. This approach aims to ensure that LLMs are designed and deployed in ways that are ethical, legal, and technically robust. The authors argue that these three types of audits, when conducted in a structured and coordinated manner, can effectively identify and manage some of the ethical and social risks posed by LLMs."}, "takeaways": {"headline": "Structured and Coordinated Auditing for Ethical and Robust LLMs", "description": "The three-layered approach to auditing LLMs proposed in this paper provides a structured and coordinated procedure for identifying and managing the ethical and social risks associated with these models. This approach can be a valuable tool for technology providers and policymakers who wish to ensure that LLMs are designed and deployed in ways that are ethical, legal, and technically robust. The authors also discuss the limitations of their approach and the prospect of auditing LLMs in general, providing a realistic perspective on what auditing can achieve.", "example": "For instance, a technology provider could use this approach to conduct a governance audit of their organization, a model audit of their LLM after pre-training, and an application audit of the applications based on their LLM. These audits would help the provider identify any ethical, legal, or technical issues and take appropriate action to address them."}, "category": "BEHAVIOR", "novelty_analysis": "The paper presents a novel approach to auditing LLMs, addressing a gap in the existing literature. The proposed three-layered approach is a unique contribution that provides a structured and coordinated procedure for auditing LLMs, which is particularly relevant given the ethical and social challenges associated with these models.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the details of the proposed three-layered approach to auditing LLMs and the ethical, legal, and technical issues associated with these models. However, the authors explain these concepts in a clear and accessible manner, making the paper understandable for readers with a basic knowledge of AI and LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and clearly written, making it an enjoyable read. The authors' discussion of the ethical and social challenges associated with LLMs and their proposed solution is engaging and thought-provoking. The paper also provides a realistic perspective on what auditing can achieve, which adds to its credibility and relevance.", "enjoyable_score": 2}