{"Published": "2023-09-02", "Title": "ModelScope-Agent: Building Your Customizable Agent System with Open-source Large Language Models", "Authors": "Chenliang Li, Hehong Chen, Ming Yan, Weizhou Shen, Haiyang Xu, Zhikai Wu, Zhicheng Zhang, Wenmeng Zhou, Yingda Chen, Chen Cheng, Hongzhu Shi, Ji Zhang, Fei Huang, Jingren Zhou", "Summary": "Large language models (LLMs) have recently demonstrated remarkable capabilities to comprehend human intentions, engage in reasoning, and design planning-like behavior. To further unleash the power of LLMs to accomplish complex tasks, there is a growing trend to build agent framework that equips LLMs, such as ChatGPT, with tool-use abilities to connect with massive external APIs. In this work, we introduce ModelScope-Agent, a general and customizable agent framework for real-world applications, based on open-source LLMs as controllers. It provides a user-friendly system library, with customizable engine design to support model training on multiple open-source LLMs, while also enabling seamless integration with both model APIs and common APIs in a unified way. To equip the LLMs with tool-use abilities, a comprehensive framework has been proposed spanning over tool-use data collection, tool retrieval, tool registration, memory control, customized model training, and evaluation for practical real-world applications. Finally, we showcase ModelScopeGPT, a real-world intelligent assistant of ModelScope Community based on the ModelScope-Agent framework, which is able to connect open-source LLMs with more than 1000 public AI models and localized community knowledge in ModelScope. The ModelScope-Agent library\\footnote{https://github.com/modelscope/modelscope-agent} and online demo\\footnote{https://modelscope.cn/studios/damo/ModelScopeGPT/summary} are now publicly available.", "main_contribution": {"headline": "ModelScope-Agent: A Customizable Agent System for Open-source LLMs", "description": "The paper introduces ModelScope-Agent, a general and customizable agent system for real-world applications, based on open-source Large Language Models (LLMs) as controllers. The system provides a user-friendly library with a customizable engine design that supports model training on multiple open-source LLMs. It also enables seamless integration with both model APIs and common APIs in a unified way. The framework proposed spans over tool-use data collection, tool retrieval, tool registration, memory control, customized model training, and evaluation for practical real-world applications. The authors showcase ModelScopeGPT, an intelligent assistant based on the ModelScope-Agent framework, which connects open-source LLMs with over 1000 public AI models and localized community knowledge in ModelScope."}, "takeaways": {"headline": "ModelScope-Agent Enables Customizable and Practical Applications of LLMs", "description": "ModelScope-Agent provides a practical framework for building customizable agent systems using open-source LLMs. It allows for the integration of LLMs with a wide range of APIs, enabling the development of intelligent assistants capable of performing complex tasks. The system's flexibility and user-friendly design make it a valuable tool for AI practitioners looking to leverage the power of LLMs in real-world applications. The showcased ModelScopeGPT demonstrates the potential of the framework in creating intelligent assistants that can connect with a vast array of public AI models.", "example": "For instance, an AI practitioner could use ModelScope-Agent to train an LLM on a specific task, such as summarizing news articles. The practitioner could then integrate the trained model with APIs for news websites, creating an intelligent assistant that can retrieve and summarize the latest news articles on a given topic."}, "category": "USE CASES", "novelty_analysis": "ModelScope-Agent represents a significant contribution to the field of LLMs, particularly in the development of agent systems. While previous research has explored the use of LLMs with tool-use abilities, this work is novel in its focus on creating a customizable agent system specifically for open-source LLMs. The system's ability to integrate with a wide range of APIs further enhances its novelty.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, detailing the design and implementation of the ModelScope-Agent system. However, it remains accessible to readers with a basic understanding of LLMs and agent systems. The authors provide clear explanations of the system's components and their functions, making the paper a valuable resource for AI practitioners interested in applying LLMs in real-world applications.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of LLMs. The authors' clear explanations and practical examples make the paper an engaging read for anyone interested in the application of LLMs in real-world scenarios.", "enjoyable_score": 3}