{"Published": "2023-03-20", "Title": "PanGu-Σ: Towards Trillion Parameter Language Model with Sparse Heterogeneous Computing", "Authors": "Xiaozhe Ren, Pingyi Zhou, Xinfan Meng, Xinjing Huang, Yadao Wang, Weichao Wang, Pengfei Li, Xiaoda Zhang, Alexander Podolskiy, Grigory Arshinov, Andrey Bout, Irina Piontkovskaya, Jiansheng Wei, Xin Jiang, Teng Su, Qun Liu, Jun Yao", "Summary": "The scaling of large language models has greatly improved natural language understanding, generation, and reasoning. In this work, we develop a system that trained a trillion-parameter language model on a cluster of Ascend 910 AI processors and MindSpore framework, and present the language model with 1.085T parameters named PanGu-{\\Sigma}. With parameter inherent from PanGu-{\\alpha}, we extend the dense Transformer model to sparse one with Random Routed Experts (RRE), and efficiently train the model over 329B tokens by using Expert Computation and Storage Separation(ECSS). This resulted in a 6.3x increase in training throughput through heterogeneous computing. Our experimental findings show that PanGu-{\\Sigma} provides state-of-the-art performance in zero-shot learning of various Chinese NLP downstream tasks. Moreover, it demonstrates strong abilities when fine-tuned in application data of open-domain dialogue, question answering, machine translation and code generation.", "main_contribution": {"headline": "PanGu-Σ: A Trillion-Parameter Language Model with Sparse Heterogeneous Computing", "description": "The paper presents PanGu-Σ, a trillion-parameter language model trained on a cluster of Ascend 910 AI processors and the MindSpore framework. The model extends the dense Transformer model to a sparse one using Random Routed Experts (RRE), which allows for the efficient training of the model over 329 billion tokens. The authors introduce the Expert Computation and Storage Separation (ECSS) mechanism, which significantly reduces communication and computation overhead, leading to a 6.3x increase in training throughput. PanGu-Σ demonstrates state-of-the-art performance in zero-shot learning of various Chinese NLP downstream tasks and shows strong abilities when fine-tuned in application data of open-domain dialogue, question answering, machine translation, and code generation."}, "takeaways": {"headline": "Efficient Training and High Performance of Trillion-Parameter Language Models", "description": "The paper demonstrates that it is possible to efficiently train a trillion-parameter language model and achieve high performance in various NLP tasks. The introduced RRE and ECSS mechanisms can be used to scale up the training of large language models without incurring a linear increase in computational cost. The ability to extract sub-models from PanGu-Σ for various downstream applications makes it highly flexible and practical for real-world applications. The techniques and findings from this paper can be used to guide the design and training of future large language models.", "example": "For instance, to train a large language model for a specific task, one could use the RRE mechanism to route tokens to different experts based on the task, and use the ECSS mechanism to efficiently train the model on a cluster of AI processors. After training, a sub-model can be extracted for the specific task and deployed in a real-world setting."}, "category": "TRAINING", "novelty_analysis": "The paper introduces novel techniques for scaling up the training of large language models, including the Random Routed Experts (RRE) mechanism and the Expert Computation and Storage Separation (ECSS) mechanism. These techniques allow for the efficient training of a trillion-parameter language model, which is a significant advancement in the field of large language models.", "novelty_score": 3, "technical_analysis": "The paper is highly technical, detailing the design and implementation of the PanGu-Σ model, the RRE and ECSS mechanisms, and the training process on a cluster of Ascend 910 AI processors. It requires a deep understanding of large language models, distributed training, and heterogeneous computing.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and provides a comprehensive overview of the design, training, and performance of the PanGu-Σ model. The technical details are explained clearly, and the experimental results are presented in a straightforward manner. However, the high level of technicality might make it a challenging read for those not familiar with the field.", "enjoyable_score": 2}