{"Published": "2023-03-22", "Title": "UPRISE: Universal Prompt Retrieval for Improving Zero-Shot Evaluation", "Authors": "Daixuan Cheng, Shaohan Huang, Junyu Bi, Yuefeng Zhan, Jianfeng Liu, Yujing Wang, Hao Sun, Furu Wei, Denvy Deng, Qi Zhang", "Summary": "Large Language Models (LLMs) are popular for their impressive abilities, but the need for model-specific fine-tuning or task-specific prompt engineering can hinder their generalization. We propose UPRISE (Universal Prompt Retrieval for Improving zero-Shot Evaluation), which tunes a lightweight and versatile retriever that automatically retrieves prompts for a given zero-shot task input. Specifically, we demonstrate universality in a cross-task and cross-model scenario: the retriever is tuned on a diverse set of tasks, but tested on unseen task types; we use a small frozen LLM, GPT-Neo-2.7B, for tuning the retriever, but test the retriever on different LLMs of much larger scales, such as BLOOM-7.1B, OPT-66B and GPT3-175B. Additionally, we show that UPRISE mitigates the hallucination problem in our experiments with ChatGPT, suggesting its potential to improve even the strongest LLMs. Our model and code are available at https://github.com/microsoft/LMOps.", "main_contribution": {"headline": "UPRISE: A Universal Prompt Retrieval System for Zero-Shot Evaluation of LLMs", "description": "The paper introduces UPRISE (Universal Prompt Retrieval for Improving zero-Shot Evaluation), a system that tunes a lightweight and versatile retriever to automatically retrieve prompts for a given zero-shot task input. The system is trained on a diverse set of tasks and tested on unseen task types, demonstrating universality in a cross-task and cross-model scenario. The retriever is tuned using a small frozen LLM, GPT-Neo-2.7B, but is tested on different LLMs of much larger scales, such as BLOOM-7.1B, OPT-66B, and GPT3-175B. The paper also shows that UPRISE can mitigate the hallucination problem in LLMs, as demonstrated in experiments with ChatGPT."}, "takeaways": {"headline": "UPRISE Enhances Zero-Shot Performance of LLMs Across Tasks and Models", "description": "UPRISE's ability to improve zero-shot performance of LLMs across different tasks and models makes it a promising solution for real-world applications. The system can be tuned with a small LLM, but can also benefit different LLMs of much larger scales. This cross-task and cross-model generalization is particularly useful in scenarios where computational resources are limited or model weights are unavailable. Furthermore, UPRISE's potential to mitigate the hallucination problem in LLMs can lead to more accurate and reliable outputs.", "example": "For instance, in a zero-shot task where the LLM is required to generate a summary of a given text, UPRISE can retrieve the most suitable prompt from a pre-constructed pool of data, guiding the LLM to produce a more accurate and coherent summary. This can be particularly useful in applications such as automated news summarization or document summarization."}, "category": "PROMPTING", "novelty_analysis": "The introduction of UPRISE represents a significant advancement in the field of LLMs. The system's ability to improve zero-shot performance across different tasks and models, as well as its potential to mitigate the hallucination problem in LLMs, are novel contributions that address some of the key challenges in the application of LLMs.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, delving into the specifics of how UPRISE is trained and how it retrieves prompts. It discusses the construction of the data pool, the scoring of prompts, and the tuning of the retriever. However, the concepts are explained in a clear and comprehensible manner, making it accessible to readers with a basic understanding of LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents a novel and intriguing contribution to the field of LLMs. The clear explanation of the system's workings, along with the presentation of experimental results, makes for an engaging read. The potential implications of UPRISE for real-world applications add to the paper's interest.", "enjoyable_score": 3}