{"Published": "2023-02-18", "Title": "The Capacity for Moral Self-Correction in Large Language Models", "Authors": "Deep Ganguli, Amanda Askell, Nicholas Schiefer, Thomas I. Liao, Kamilė Lukošiūtė, Anna Chen, Anna Goldie, Azalia Mirhoseini, Catherine Olsson, Danny Hernandez, Dawn Drain, Dustin Li, Eli Tran-Johnson, Ethan Perez, Jackson Kernion, Jamie Kerr, Jared Mueller, Joshua Landau, Kamal Ndousse, Karina Nguyen, Liane Lovitt, Michael Sellitto, Nelson Elhage, Noemi Mercado, Nova DasSarma, Oliver Rausch, Robert Lasenby, Robin Larson, Sam Ringer, Sandipan Kundu, Saurav Kadavath, Scott Johnston, Shauna Kravec, Sheer El Showk, Tamera Lanham, Timothy Telleen-Lawton, Tom Henighan, Tristan Hume, Yuntao Bai, Zac Hatfield-Dodds, Ben Mann, Dario Amodei, Nicholas Joseph, Sam McCandlish, Tom Brown, Christopher Olah, Jack Clark, Samuel R. Bowman, Jared Kaplan", "Summary": "We test the hypothesis that language models trained with reinforcement learning from human feedback (RLHF) have the capability to \"morally self-correct\" -- to avoid producing harmful outputs -- if instructed to do so. We find strong evidence in support of this hypothesis across three different experiments, each of which reveal different facets of moral self-correction. We find that the capability for moral self-correction emerges at 22B model parameters, and typically improves with increasing model size and RLHF training. We believe that at this level of scale, language models obtain two capabilities that they can use for moral self-correction: (1) they can follow instructions and (2) they can learn complex normative concepts of harm like stereotyping, bias, and discrimination. As such, they can follow instructions to avoid certain kinds of morally harmful outputs. We believe our results are cause for cautious optimism regarding the ability to train language models to abide by ethical principles.", "main_contribution": {"headline": "Large Language Models Can Morally Self-Correct with Proper Instructions", "description": "The paper investigates the capacity of large language models (LLMs) to morally self-correct, i.e., to avoid producing harmful outputs when instructed to do so. The authors conduct three experiments, each revealing different aspects of moral self-correction. They find that this capability emerges at 22 billion model parameters and generally improves with increasing model size and reinforcement learning from human feedback (RLHF) training. The authors argue that at this scale, LLMs can follow instructions and learn complex normative concepts of harm like stereotyping, bias, and discrimination. Therefore, they can follow instructions to avoid certain kinds of morally harmful outputs. The paper provides evidence supporting cautious optimism about the ability to train LLMs to abide by ethical principles."}, "takeaways": {"headline": "Instructing LLMs to Avoid Harmful Outputs Can Improve Ethical Compliance", "description": "The paper's findings suggest that with proper instructions, LLMs can be guided to avoid harmful outputs, thereby improving their ethical compliance. This is particularly relevant for applications where LLMs interact directly with users, such as chatbots, customer service bots, or content moderation systems. By incorporating instructions to avoid bias, discrimination, or stereotyping into the prompts given to the LLM, developers can potentially reduce the risk of harmful outputs. However, the authors caution that this approach is not a panacea and that further research is needed to address the limitations and potential pitfalls of this method.", "example": "For instance, a customer service chatbot could be instructed as follows: 'Please provide assistance to the user, ensuring that your responses are unbiased and do not rely on stereotypes.' This instruction could help the LLM avoid potentially harmful outputs, such as those that might reinforce negative stereotypes or exhibit bias."}, "category": "BEHAVIOR", "novelty_analysis": "The paper presents a novel exploration of the capacity of LLMs to morally self-correct when given appropriate instructions. While the idea of instructing LLMs to avoid harmful outputs is not entirely new, the authors' experiments and results provide new insights into the scale at which this capability emerges and how it can be improved with RLHF training.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design and results of experiments involving LLMs and RLHF training. However, the authors do a good job of explaining their methodology and findings in a way that should be accessible to readers with a basic understanding of machine learning and natural language processing.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and clearly written, making it an enjoyable read for those interested in the ethical implications of LLMs. The authors' cautious optimism about the potential for LLMs to morally self-correct, balanced by their recognition of the limitations and challenges of this approach, provides a nuanced and thoughtful perspective on this important issue.", "enjoyable_score": 2}