{"Published": "2023-05-16", "Title": "StructGPT: A General Framework for Large Language Model to Reason over Structured Data", "Authors": "Jinhao Jiang, Kun Zhou, Zican Dong, Keming Ye, Wayne Xin Zhao, Ji-Rong Wen", "Summary": "In this paper, we study how to improve the zero-shot reasoning ability of large language models~(LLMs) over structured data in a unified way. Inspired by the study on tool augmentation for LLMs, we develop an \\emph{Iterative Reading-then-Reasoning~(IRR)} approach for solving question answering tasks based on structured data, called \\textbf{StructGPT}. In our approach, we construct the specialized function to collect relevant evidence from structured data (\\ie \\emph{reading}), and let LLMs concentrate the reasoning task based on the collected information (\\ie \\emph{reasoning}). Specially, we propose an \\emph{invoking-linearization-generation} procedure to support LLMs in reasoning on the structured data with the help of the external interfaces. By iterating this procedures with provided interfaces, our approach can gradually approach the target answer to a given query. Extensive experiments conducted on three types of structured data demonstrate the effectiveness of our approach, which can significantly boost the performance of ChatGPT and achieve comparable performance against the full-data supervised-tuning baselines. Our codes and data are publicly available at~\\url{https://github.com/RUCAIBox/StructGPT}.", "main_contribution": {"headline": "StructGPT: Enhancing LLMs' Reasoning Ability Over Structured Data", "description": "The paper introduces StructGPT, an Iterative Reading-then-Reasoning (IRR) approach that enhances the zero-shot reasoning ability of large language models (LLMs) over structured data. The approach separates the processes of reading and reasoning, using specialized interfaces to accurately and efficiently access and filter data from structured data sources such as knowledge graphs, data tables, and databases. The LLM then focuses on reasoning based on the evidence obtained from these interfaces. The authors propose an invoking-linearization-generation procedure that supports LLMs in reading and reasoning on the structured data with the help of the external interfaces. By iterating this procedure with provided interfaces, StructGPT can gradually approach the target answer to a given query."}, "takeaways": {"headline": "StructGPT Boosts LLM Performance on Structured Data", "description": "StructGPT provides a unified framework for improving LLMs' reasoning abilities over structured data. By separating the processes of reading and reasoning, and using specialized interfaces for data access and filtering, LLMs can focus on reasoning tasks based on the collected information. This approach can be applied to a wide range of tasks, such as KG-based question answering, Table-based question answering, and DB-based Text-to-SQL. The experimental results demonstrate that StructGPT can significantly enhance the reasoning performance of ChatGPT on structured data, achieving comparable performance with competitive full-data supervised-tuning methods.", "example": "For instance, in a KG-based question answering task, StructGPT can invoke an interface to extract relevant triples from a knowledge graph, linearize the triples into a textual prompt, and feed the prompt into the LLM for generation. By iterating this procedure, the LLM can gradually approach the target answer to a given question."}, "category": "FINE-TUNING", "novelty_analysis": "StructGPT introduces a novel approach to improving the reasoning abilities of LLMs over structured data. The Iterative Reading-then-Reasoning (IRR) approach and the invoking-linearization-generation procedure are unique contributions that provide a unified framework for LLMs to reason over different types of structured data.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, discussing the design of specialized interfaces for structured data and the invoking-linearization-generation procedure. However, the concepts are explained clearly and the paper provides practical examples, making it accessible to readers with a basic understanding of LLMs and structured data.", "technical_score": 2, "enjoyable_analysis": "The paper is well-structured and presents an interesting approach to enhancing the reasoning abilities of LLMs over structured data. The clear explanations and practical examples make it an enjoyable read for those interested in the application of LLMs in question answering tasks based on structured data.", "enjoyable_score": 2}