{"Published": "2023-07-14", "Title": "Unleashing Cognitive Synergy in Large Language Models: A Task-Solving Agent through Multi-Persona Self-Collaboration", "Authors": "Zhenhailong Wang, Shaoguang Mao, Wenshan Wu, Tao Ge, Furu Wei, Heng Ji", "Summary": "Human intelligence thrives on the concept of cognitive synergy, where collaboration and information integration among different cognitive processes yield superior outcomes compared to individual cognitive processes in isolation. Although Large Language Models (LLMs) have demonstrated promising performance as general task-solving agents, they still struggle with tasks that require intensive domain knowledge and complex reasoning. In this work, we propose Solo Performance Prompting (SPP), which transforms a single LLM into a cognitive synergist by engaging in multi-turn self-collaboration with multiple personas. A cognitive synergist refers to an intelligent agent that collaborates with multiple minds, combining their individual strengths and knowledge, to enhance problem-solving and overall performance in complex tasks. By dynamically identifying and simulating different personas based on task inputs, SPP unleashes the potential of cognitive synergy in LLMs. We have discovered that assigning multiple, fine-grained personas in LLMs elicits better problem-solving abilities compared to using a single or fixed number of personas. We evaluate SPP on three challenging tasks: Trivia Creative Writing, Codenames Collaborative, and Logic Grid Puzzle, encompassing both knowledge-intensive and reasoning-intensive types. Unlike previous works, such as Chain-of-Thought, that solely enhance the reasoning abilities in LLMs, SPP effectively elicits internal knowledge acquisition abilities, reduces hallucination, and maintains strong reasoning capabilities. Code, data, and prompts can be found at: https://github.com/MikeWangWZHL/Solo-Performance-Prompting.git.", "main_contribution": {"headline": "Solo Performance Prompting (SPP) enhances LLMs' problem-solving abilities", "description": "This paper introduces Solo Performance Prompting (SPP), a novel method that transforms a single Large Language Model (LLM) into a cognitive synergist by engaging in multi-turn self-collaboration with multiple personas. SPP dynamically identifies and simulates different personas based on task inputs, thereby enhancing the problem-solving abilities of LLMs. The authors found that assigning multiple, fine-grained personas in LLMs elicits better problem-solving abilities compared to using a single or fixed number of personas. SPP was evaluated on three challenging tasks and was found to effectively elicit internal knowledge acquisition abilities, reduce hallucination, and maintain strong reasoning capabilities."}, "takeaways": {"headline": "SPP offers a new approach to enhance LLMs' problem-solving capabilities", "description": "The Solo Performance Prompting (SPP) method provides a new way to enhance the problem-solving capabilities of LLMs by simulating multiple personas. This approach can be particularly useful in tasks that require intensive domain knowledge and complex reasoning. By dynamically identifying and simulating different personas based on task inputs, SPP can help LLMs better understand and solve complex tasks. This method can be applied to improve the performance of LLMs in various applications, such as creative writing, collaborative games, and logic puzzles.", "example": "For instance, in a task that requires writing a background story for a game character, SPP can simulate multiple personas, such as a game designer, a Harry Potter fan, a Game of Thrones fan, and a Jay Chou fan, to generate a more comprehensive and engaging story."}, "category": "PROMPTING", "novelty_analysis": "The introduction of Solo Performance Prompting (SPP) represents a significant advancement in the field of LLMs. The concept of transforming a single LLM into a cognitive synergist by simulating multiple personas is a novel approach that enhances the problem-solving capabilities of LLMs.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical as it introduces a new method, Solo Performance Prompting (SPP), and explains its workings in detail. However, it does not delve into complex mathematical theories or algorithms, making it accessible to readers with a basic understanding of LLMs.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and presents a novel and intriguing contribution to the field of LLMs. The concept of cognitive synergy and the introduction of SPP make the paper an interesting read.", "enjoyable_score": 3}