{"Published": "2023-07-25", "Title": "WebArena: A Realistic Web Environment for Building Autonomous Agents", "Authors": "Shuyan Zhou, Frank F. Xu, Hao Zhu, Xuhui Zhou, Robert Lo, Abishek Sridhar, Xianyi Cheng, Yonatan Bisk, Daniel Fried, Uri Alon, Graham Neubig", "Summary": "With generative AI advances, the exciting potential for autonomous agents to manage daily tasks via natural language commands has emerged. However, cur rent agents are primarily created and tested in simplified synthetic environments, substantially limiting real-world scenario representation. In this paper, we build an environment for agent command and control that is highly realistic and reproducible. Specifically, we focus on agents that perform tasks on websites, and we create an environment with fully functional websites from four common domains: e-commerce, social forum discussions, collaborative software development, and content management. Our environment is enriched with tools (e.g., a map) and external knowledge bases (e.g., user manuals) to encourage human-like task-solving. Building upon our environment, we release a set of benchmark tasks focusing on evaluating the functional correctness of task completions. The tasks in our benchmark are diverse, long-horizon, and are designed to emulate tasks that humans routinely perform on the internet. We design and implement several autonomous agents, integrating recent techniques such as reasoning before acting. The results demonstrate that solving complex tasks is challenging: our best GPT-4-based agent only achieves an end-to-end task success rate of 10.59%. These results highlight the need for further development of robust agents, that current state-of-the-art LMs are far from perfect performance in these real-life tasks, and that WebArena can be used to measure such progress. Our code, data, environment reproduction resources, and video demonstrations are publicly available at https://webarena.dev/.", "main_contribution": {"headline": "WebArena: A Realistic Web Environment for Building Autonomous Agents", "description": "The paper introduces WebArena, a realistic and reproducible environment for building and testing autonomous agents that perform tasks on the web. The environment includes fully functional websites from four common domains: e-commerce, social forum discussions, collaborative software development, and content management. It is enriched with tools and external knowledge bases to encourage human-like task-solving. The authors also release a set of benchmark tasks to evaluate the functional correctness of task completions. The tasks are diverse, long-horizon, and designed to emulate tasks that humans routinely perform on the internet."}, "takeaways": {"headline": "WebArena provides a realistic testing ground for autonomous agents", "description": "WebArena offers a realistic and reproducible environment for testing and developing autonomous agents, providing a more accurate representation of real-world scenarios than simplified synthetic environments. It can be used to measure the progress of autonomous agents in performing complex tasks on the web. The benchmark tasks released alongside WebArena can be used to evaluate the functional correctness of task completions, providing a standard for comparing the performance of different agents.", "example": "For instance, an LLM practitioner could use WebArena to test an autonomous agent designed to perform tasks on an e-commerce website. The agent could be tasked with finding a specific product, adding it to the cart, and proceeding to checkout. The success of the task completion could then be evaluated using the benchmark tasks provided with WebArena."}, "category": "USE CASES", "novelty_analysis": "WebArena is a novel contribution to the field of autonomous agents. It provides a realistic and reproducible environment for testing and developing these agents, which is a significant advancement over the simplified synthetic environments that are commonly used.", "novelty_score": 3, "technical_analysis": "The paper is somewhat technical, as it describes the design and implementation of WebArena and the autonomous agents tested within it. However, it does not delve into complex mathematical theories or algorithms, making it accessible to a wide range of readers.", "technical_score": 2, "enjoyable_analysis": "The paper is well-written and organized, presenting a novel and intriguing contribution to the field of autonomous agents. The use of real-world examples and the clear explanation of the design and implementation of WebArena make it an enjoyable read.", "enjoyable_score": 3}