{"Published": "2023-07-20", "Title": "LLMs as Workers in Human-Computational Algorithms? Replicating Crowdsourcing Pipelines with LLMs", "Authors": "Tongshuang Wu, Haiyi Zhu, Maya Albayrak, Alexis Axon, Amanda Bertsch, Wenxing Deng, Ziqi Ding, Bill Guo, Sireesh Gururaja, Tzu-Sheng Kuo, Jenny T. Liang, Ryan Liu, Ihita Mandal, Jeremiah Milbauer, Xiaolin Ni, Namrata Padmanabhan, Subhashini Ramkumar, Alexis Sudjianto, Jordan Taylor, Ying-Jui Tseng, Patricia Vaidos, Zhijin Wu, Wei Wu, Chenyang Yang", "Summary": "LLMs have shown promise in replicating human-like behavior in crowdsourcing tasks that were previously thought to be exclusive to human abilities. However, current efforts focus mainly on simple atomic tasks. We explore whether LLMs can replicate more complex crowdsourcing pipelines. We find that modern LLMs can simulate some of crowdworkers' abilities in these \"human computation algorithms,\" but the level of success is variable and influenced by requesters' understanding of LLM capabilities, the specific skills required for sub-tasks, and the optimal interaction modality for performing these sub-tasks. We reflect on human and LLMs' different sensitivities to instructions, stress the importance of enabling human-facing safeguards for LLMs, and discuss the potential of training humans and LLMs with complementary skill sets. Crucially, we show that replicating crowdsourcing pipelines offers a valuable platform to investigate (1) the relative strengths of LLMs on different tasks (by cross-comparing their performances on sub-tasks) and (2) LLMs' potential in complex tasks, where they can complete part of the tasks while leaving others to humans.", "main_contribution": {"headline": "Exploration of LLMs in Replicating Complex Crowdsourcing Pipelines", "description": "The paper investigates the potential of Large Language Models (LLMs) in replicating complex crowdsourcing pipelines, going beyond simple atomic tasks. The authors find that LLMs can simulate some abilities of crowdworkers in these 'human computation algorithms', but the success level varies. Factors influencing this include the understanding of LLM capabilities by requesters, the specific skills required for sub-tasks, and the optimal interaction modality for performing these sub-tasks. The paper also highlights the importance of human-facing safeguards for LLMs and discusses the potential of training humans and LLMs with complementary skill sets."}, "takeaways": {"headline": "LLMs Can Potentially Replace Humans in Complex Crowdsourcing Tasks", "description": "The paper suggests that LLMs can be used to replicate complex crowdsourcing pipelines, potentially replacing human workers in certain advanced 'human-computational processes'. However, the success of this depends on several factors, including the understanding of LLM capabilities by requesters, the specific skills required for sub-tasks, and the optimal interaction modality for performing these sub-tasks. This opens up new avenues for LLM practitioners to explore, especially in the context of crowdsourcing tasks.", "example": "For instance, an LLM could be used to replicate a complex crowdsourcing pipeline that involves multiple sub-tasks, such as data collection, data cleaning, data analysis, and report generation. The LLM could be trained to perform each of these sub-tasks, potentially reducing the need for human intervention."}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel exploration of the potential of LLMs in replicating complex crowdsourcing pipelines, a topic that has not been extensively studied before. The findings provide new insights into the capabilities of LLMs and their potential applications in the field of crowdsourcing.", "novelty_score": 3, "technical_analysis": "The paper is not overly technical. It discusses the potential of LLMs in replicating complex crowdsourcing pipelines and the factors that influence their success, without delving into complex mathematical theories or algorithms.", "technical_score": 1, "enjoyable_analysis": "The paper is well-written and presents an interesting exploration of the potential of LLMs in replicating complex crowdsourcing pipelines. It provides valuable insights into the capabilities of LLMs and their potential applications, making it an enjoyable read for those interested in the field of LLMs and crowdsourcing.", "enjoyable_score": 3}