{"Published": "2023-09-13", "Title": "AnomalyGPT: Detecting Industrial Anomalies using Large Vision-Language Models", "Authors": "Zhaopeng Gu, Bingke Zhu, Guibo Zhu, Yingying Chen, Ming Tang, Jinqiao Wang", "Summary": "Large Vision-Language Models (LVLMs) such as MiniGPT-4 and LLaVA have demonstrated the capability of understanding images and achieved remarkable performance in various visual tasks. Despite their strong abilities in recognizing common objects due to extensive training datasets, they lack specific domain knowledge and have a weaker understanding of localized details within objects, which hinders their effectiveness in the Industrial Anomaly Detection (IAD) task. On the other hand, most existing IAD methods only provide anomaly scores and necessitate the manual setting of thresholds to distinguish between normal and abnormal samples, which restricts their practical implementation. In this paper, we explore the utilization of LVLM to address the IAD problem and propose AnomalyGPT, a novel IAD approach based on LVLM. We generate training data by simulating anomalous images and producing corresponding textual descriptions for each image. We also employ an image decoder to provide fine-grained semantic and design a prompt learner to fine-tune the LVLM using prompt embeddings. Our AnomalyGPT eliminates the need for manual threshold adjustments, thus directly assesses the presence and locations of anomalies. Additionally, AnomalyGPT supports multi-turn dialogues and exhibits impressive few-shot in-context learning capabilities. With only one normal shot, AnomalyGPT achieves the state-of-the-art performance with an accuracy of 86.1%, an image-level AUC of 94.1%, and a pixel-level AUC of 95.3% on the MVTec-AD dataset. Code is available at https://github.com/CASIA-IVA-Lab/AnomalyGPT.", "main_contribution": {"headline": "AnomalyGPT: A Novel Approach for Industrial Anomaly Detection Using Large Vision-Language Models", "description": "The paper presents AnomalyGPT, a novel approach for Industrial Anomaly Detection (IAD) that leverages Large Vision-Language Models (LVLMs). The authors address the limitations of existing LVLMs, which, despite their strong abilities in recognizing common objects, lack specific domain knowledge and have a weaker understanding of localized details within objects. AnomalyGPT generates training data by simulating anomalous images and producing corresponding textual descriptions for each image. It employs an image decoder to provide fine-grained semantic and a prompt learner to fine-tune the LVLM using prompt embeddings. This approach eliminates the need for manual threshold adjustments, directly assessing the presence and locations of anomalies. AnomalyGPT also supports multi-turn dialogues and exhibits impressive few-shot in-context learning capabilities. The authors report state-of-the-art performance on the MVTec-AD dataset."}, "takeaways": {"headline": "AnomalyGPT: A Practical Solution for Industrial Anomaly Detection", "description": "AnomalyGPT's ability to directly assess the presence and locations of anomalies without the need for manual threshold adjustments makes it a practical solution for industrial anomaly detection. Its support for multi-turn dialogues and impressive few-shot in-context learning capabilities further enhance its applicability. The approach can be used to build systems that can detect and locate anomalies in industrial images, which can be particularly useful in quality control processes in manufacturing industries. For example, AnomalyGPT can be used to inspect images of manufactured products and detect any anomalies or defects, providing detailed information about the presence and location of the anomalies.", "example": "python\n# Assume we have a trained AnomalyGPT model\nanomaly_detector = AnomalyGPT()\n\n# Load an industrial image\nimage = load_image('industrial_image.jpg')\n\n# Detect anomalies\nanomalies = anomaly_detector.detect_anomalies(image)\n\n# Print the presence and locations of anomalies\nfor anomaly in anomalies:\n    print(f'Anomaly detected at location: {anomaly.location}')\n"}, "category": "USE CASES", "novelty_analysis": "The paper presents a novel approach to Industrial Anomaly Detection (IAD) by leveraging Large Vision-Language Models (LVLMs). The introduction of AnomalyGPT, which combines the use of simulated anomalous images, an image decoder for fine-grained semantic, and a prompt learner for fine-tuning the LVLM, represents a significant advancement in the field of IAD.", "novelty_score": 3, "technical_analysis": "The paper is quite technical, delving into the details of the proposed AnomalyGPT approach, including the generation of training data, the use of an image decoder and a prompt learner, and the fine-tuning of the LVLM. It also presents a comprehensive comparison of AnomalyGPT with existing IAD methods and LVLMs, providing detailed experimental results and analyses.", "technical_score": 3, "enjoyable_analysis": "The paper is well-structured and provides a clear explanation of the proposed approach, making it an engaging read for those interested in the application of Large Vision-Language Models in Industrial Anomaly Detection. The inclusion of extensive experimental results and comparisons with existing methods adds to the paper's readability and provides a comprehensive understanding of the topic.", "enjoyable_score": 2}